{
	"_meta": {
		"sources": [
			{
				"json": "CM-M",
				"abbreviation": "CM-M",
				"full": "Candlekeep Mysteries Modified",
				"url": "https://raw.githubusercontent.com/Piefrenzy/CM-M/master/Modified_CM_Monsters_and_Items.json",
				"authors": [
					"Ben Dickinson"
				],
				"convertedBy": [
					"https://raw.githubusercontent.com/Piefrenzy/CM-M/master/Modified_CM_Monsters_and_Items.json"
				],
				"color": "#00d1b9"
			}
		],
		"dateAdded": 1586966344,
		"dateLastModified": 1692309855
	},
	"monster": [
		{
			"name": "Valin",
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": "undead",
			"alignment": [
				"L",
				"E"
			],
			"ac": [
				{
					"ac": 17,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "40d8 + 120",
				"average": 300
			},
			"speed": {
				"walk": 20
			},
			"str": 20,
			"dex": 10,
			"con": 16,
			"int": 11,
			"wis": 20,
			"cha": 16,
			"save": {
				"con": "+8",
				"int": "+5",
				"wis": "+10",
				"cha": "+8"
			},
			"skill": {
				"history": "+5",
				"religion": "+5"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 15,
			"immune": [
				"necrotic",
				"poison"
			],
			"conditionImmune": [
				"blinded",
				"charmed",
				"deafened",
				"exhaustion",
				"frightened",
				"paralyzed",
				"poisoned"
			],
			"languages": [
				"the languages it knew in life"
			],
			"cr": {
				"cr": "15",
				"lair": "16"
			},
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"Valin is a 10th-level spellcaster. Its spellcasting ability is Wisdom (spell save {@dc 18}, {@hit 10} to hit with spell attacks). Valin has the following cleric spells prepared:"
					],
					"spells": {
						"0": {
							"spells": [
								"{@spell sacred flame}",
								"{@spell thaumaturgy}"
							]
						},
						"1": {
							"spells": [
								"{@spell command}",
								"{@spell guiding bolt}",
								"{@spell shield of faith}"
							],
							"slots": 4
						},
						"2": {
							"spells": [
								"{@spell hold person}",
								"{@spell silence}",
								"{@spell spiritual weapon}"
							],
							"slots": 3
						},
						"3": {
							"spells": [
								"{@spell animate dead}",
								"{@spell dispel magic}"
							],
							"slots": 3
						},
						"4": {
							"spells": [
								"{@spell divination}",
								"{@spell guardian of faith}"
							],
							"slots": 3
						},
						"5": {
							"spells": [
								"{@spell contagion}",
								"{@spell insect plague}"
							],
							"slots": 2
						},
						"6": {
							"spells": [
								"{@spell harm}",
								"{@spell circle of death}"
							],
							"slots": 1
						}
					},
					"ability": "wis",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Magic Resistance",
					"entries": [
						"Valin has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "Rejuvenation",
					"entries": [
						"Valin gains a new body in 24 hours if her heart is intact, regaining all her hit points and becoming active again. The new body appears within 5 feet of Valin's heart."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Valin can use her Dreadful Glare and makes one attack with her rotting fist."
					]
				},
				{
					"name": "Rotting Fist",
					"entries": [
						"{@atk mw} {@hit 10} to hit, reach 5 ft., one target. {@h}15 ({@damage 3d6 + 5}) bludgeoning damage plus 21 ({@damage 6d6}) necrotic damage. If the target is a creature, it must succeed on a {@dc 16} Constitution saving throw or be cursed with mummy rot. The cursed target can't regain hit points, and its hit point maximum decreases by 10 ({@dice 3d6}) for every 24 hours that elapse. If the curse reduces the target's hit point maximum to 0, the target dies, and its body turns to dust. The curse lasts until removed by the {@spell remove curse} spell or other magic."
					]
				},
				{
					"name": "Dreadful Glare",
					"entries": [
						"Valin targets one creature it can see within 60 feet of it. If the target can see the Valin, it must succeed on a {@dc 16} Wisdom saving throw against this magic or become {@condition frightened} until the end of Valin's next turn. If the target fails the saving throw by 5 or more, it is also {@condition paralyzed} for the same duration. A target that succeeds on the saving throw is immune to the Dreadful Glare of all mummies and mummy lords for the next 24 hours."
					]
				}
			],
			"legendary": [
				{
					"name": "Attack",
					"entries": [
						"Valin makes one attack with her rotting fist or uses her Dreadful Glare."
					]
				},
				{
					"name": "Blinding Dust",
					"entries": [
						"Blinding dust and sand swirls magically around Valin. Each creature within 5 feet of Valin must succeed on a {@dc 16} Constitution saving throw or be {@condition blinded} until the end of the creature's next turn."
					]
				},
				{
					"name": "Blasphemous Word (Costs 2 Actions)",
					"entries": [
						"Valin utters a blasphemous word. Each non-undead creature within 10 feet of Valin that can hear the magical utterance must succeed on a {@dc 16} Constitution saving throw or be {@condition stunned} until the end Valin's next turn."
					]
				},
				{
					"name": "Channel Negative Energy (Costs 2 Actions)",
					"entries": [
						"Valin magically unleashes negative energy. Creatures within 60 feet of Valin including ones behind barriers and around corners, can't regain hit points until the end of Valin's next turn."
					]
				},
				{
					"name": "Whirlwind of Sand (Costs 2 Actions)",
					"entries": [
						"Valin magically transforms into a whirlwind of sand, moves up to 60 feet, and reverts to her normal form. While in whirlwind form, Valin is immune to all damage, and it can't be {@condition grappled}, {@condition petrified}, knocked {@condition prone}, {@condition restrained}, or {@condition stunned}. Equipment worn or carried by Valin remain in its possession."
					]
				}
			],
			"legendaryGroup": {
				"name": "Mummy Lord",
				"source": "MM"
			},
			"environment": [
				"desert"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/mummy-lord.mp3"
			},
			"traitTags": [
				"Magic Resistance",
				"Rejuvenation"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"LF"
			],
			"spellcastingTags": [
				"CC"
			],
			"miscTags": [
				"MW",
				"AOE"
			],
			"conditionInflict": [
				"blinded",
				"frightened",
				"paralyzed",
				"stunned"
			],
			"conditionInflictSpell": [
				"blinded",
				"deafened",
				"paralyzed",
				"poisoned",
				"prone",
				"stunned"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/CM/Valin%20Sarnaster.png",
			"fluff": {
				"entries": [
					"[",
					{
						"type": "entries",
						"entries": [
							"Valin Sarnaster has been thoroughly corrupted by visions of a future in which she sees herself as the immortal heir of Savras's realm.{@i The Canopic Being}came into her possession years ago, and an obsession with the dark rituals therein set the oracle on her present course.",
							"Valin has become a powerful undead as the first step on her path to godhood, and is now a mummy lord.",
							"Valin can use her lair actions in any area of the tomb."
						]
					},
					{
						"type": "section",
						"entries": [
							{
								"type": "entries",
								"name": "Valin Sarnaster's Lair",
								"entries": [
									"Valin can use her lair actions in any area of the tomb."
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Lair Actions",
								"entries": [
									"On initiative count 20 (losing initiative ties), Valin takes a lair action to cause one of the following effects; Valin can't use the same effect two rounds in a row.",
									{
										"type": "list",
										"items": [
											"Each undead creature in the lair can pinpoint the location of each living creature within 120 feet of it until initiative count 20 on the next round.",
											"Each undead in the lair has advantage on saving throws against effects that turn undead until initiative count 20 on the next round.",
											"Until initiative count 20 on the next round, any non-undead creature that tries to cast a spell of 4th level or lower in Valin's lair is wracked with pain. The creature can choose another action, but if it tries to cast the spell, it must make a DC 16 Constitution saving throw. On a failed save, it takes {@damage 1d6} necrotic damage per level of the spell, and the spell has no effect and is wasted."
										]
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Regional Effects",
								"entries": [
									"Valin's tomb is warped in any of the following ways by the creature's dark presence:",
									{
										"type": "list",
										"items": [
											"Food instantly molders and water instantly evaporates when brought into the lair. Other nonmagical drinks are spoiled—wine turning to vinegar, for instance.",
											"{@spell Divination} spells cast within the lair by creatures other than Valin have a {@chance 25|25 percent} chance to provide misleading results, as determined by the DM. If a {@spell divination} spell already has a chance to fail or become unreliable when cast multiple times, that chance increases by 25 percent.",
											"A creature that takes treasure from the lair is cursed until the treasure is returned. The cursed target has disadvantage on all saving throws. The curse lasts until removed by a {@spell remove curse} spell or other magic."
										]
									},
									"If Valin is destroyed, these regional effects end immediately."
								]
							}
						]
					},
					"]"
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://5e.tools/img/bestiary/CM/Valin%20Sarnaster.jpg"
						}
					}
				]
			},
			"isNamedCreature": true,
			"damageTags": [
				"B",
				"N"
			],
			"damageTagsSpell": [
				"N",
				"O",
				"P",
				"R"
			],
			"savingThrowForced": [
				"constitution",
				"wisdom"
			],
			"savingThrowForcedSpell": [
				"constitution",
				"dexterity",
				"wisdom"
			],
			"savingThrowForcedLegendary": [
				"constitution"
			],
			"uniqueId": "e1580948-5069-4a93-9173-12cb57e8a196"
		},
		{
			"name": "Ssendam, Lord of Madness",
			"isNamedCreature": true,
			"source": "CM-M",
			"page": 105,
			"size": [
				"L"
			],
			"type": {
				"type": "aberration",
				"tags": [
					"shapechanger"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 19,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "50d20 + 350",
				"average": 875
			},
			"speed": {
				"walk": 30,
				"swim": 30
			},
			"str": 20,
			"dex": 24,
			"con": 24,
			"int": 20,
			"wis": 18,
			"cha": 26,
			"save": {
				"con": "+14",
				"dex": "+14",
				"cha": "+15"
			},
			"skill": {
				"arcana": "+12",
				"deception": "+15",
				"insight": "+18",
				"intimidation": "+15",
				"perception": "+11"
			},
			"senses": [
				"blindsight 60 ft.",
				"truesight 120 ft."
			],
			"passive": 21,
			"resist": [
				"acid",
				"cold",
				"fire",
				"lightning",
				"thunder"
			],
			"immune": [
				"necrotic",
				"poison",
				{
					"immune": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks",
					"cond": true
				}
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"frightened",
				"poisoned"
			],
			"languages": [
				"all",
				"telepathy 120 ft."
			],
			"cr": "23",
			"spellcasting": [
				{
					"name": "Innate Spellcasting",
					"headerEntries": [
						"Ssendam's innate spellcasting ability is Charisma (spell save {@dc 22}, {@hit 14} to hit with spell attacks). Ssendam can innately cast the following spells, requiring no material components:"
					],
					"will": [
						"{@spell detect evil and good}",
						"{@spell detect magic}",
						"{@spell detect thoughts}",
						"{@spell dispel magic}",
						"{@spell fear}",
						"{@spell fly}",
						"{@spell mass suggestion}",
						"{@spell plane shift}"
					],
					"daily": {
						"1e": [
							"{@spell power word heal}",
							"{@spell power word pain|XGE}",
							"{@spell power word stun}"
						],
						"2e": [
							"{@spell finger of death}",
							"{@spell flame strike}"
						]
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Aura of Madness",
					"entries": [
						"Any creature (other than undead or constructs) that ends its turn within 10 feet of Ssendam must make a {@dc 20} Charisma saving throw or be inflicted with a random short-term madness. If a creature succeeds against any madness ability of Ssendam's, they are immune to Ssendam's madness for 1 hour."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If Ssendam fails a saving throw, she can choose to succeed instead."
					]
				},
				{
					"name": "Magic Resistance",
					"entries": [
						"Ssendam has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "Magic Weapons",
					"entries": [
						"Ssendam's weapon attacks are magical."
					]
				},
				{
					"name": "Regeneration (Golden Amoeba Form Only)",
					"entries": [
						"Ssendam regains 40 hit points at the start of her turn if she has at least 1 hit point."
					]
				},
				{
					"name": "Shapechanger",
					"entries": [
						"Ssendam can use her action to polymorph into a Small or Medium humanoid, into a Small aberration that looks like a golden amoeba, or back into this, her golden slaad form. Any equipment she is wearing or carrying isn't transformed. She reverts to her true form if she dies. Her statistics in the humanoid forms, other than her size, are the same.",
						"While in her amoeba form, Ssendam has the same statistics with the following changes. She can't take any actions (except her Shapechanger action), speak, or manipulate objects. She has a movement speed of 40 feet and can enter a hostile creature's space and stop there. In addition, Ssendam can move through a space as narrow as 1 inch wide without squeezing. She has advantage on Strength and Dexterity saving throws, and has resistance to all damage except psychic and radiant."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Ssendam makes three attacks: one with her Touch of Madness and two with her chaos staff."
					]
				},
				{
					"name": "Chaos Staff",
					"entries": [
						"{@atk mw} {@hit 12} to hit, reach 5 ft., one target. {@h}12 ({@damage 2d6 + 5}) bludgeoning damage plus 16 ({@damage 3d10}) necrotic damage. The target must also make a {@dc 19} Constitution or be {@condition stunned}. The target may repeat the saving throw at the end of each of their turns."
					]
				},
				{
					"name": "Summon Slaadi (1/Day)",
					"entries": [
						"Ssendam summons {@dice 1d4 + 1} {@creature death slaad||death slaadi}. A summoned slaad appears in an unoccupied space within 60 feet of Ssendam, acts as an ally of Ssendam, and can't summon other slaadi. It remains for 1 minute, until it or Ssendam dies, or until Ssendam dismisses it as an action."
					]
				},
				{
					"name": "Teleport",
					"entries": [
						"Ssendam magically teleports, along with any equipment she is wearing or carrying, up to 120 feet to an unoccupied space she can see."
					]
				},
				{
					"name": "Touch of Madness",
					"entries": [
						"{@atk mw} {@hit 12} to hit, reach 5 ft., one target. {@h}10 ({@damage 1d10 + 5}) slashing damage plus 16 ({@damage 3d10}) necrotic damage. A target that fails a {@dc 20} Charisma saving throw is inflicted with a random short-term madness. If it is already mad, the existing madness is replaced with a random long-term madness."
					]
				}
			],
			"reaction": [
				{
					"name": "Amoeba",
					"entries": [
						"When damaged, Ssendam can use her reaction to shapechange into her golden amoeba form and the damage is reduced to 0."
					]
				}
			],
			"legendary": [
				{
					"name": "Chaos Staff",
					"entries": [
						"Ssendam makes one attack with her chaos staff."
					]
				},
				{
					"name": "Teleport",
					"entries": [
						"Ssendam uses her Teleport action."
					]
				},
				{
					"name": "Subversion (Costs 2 Actions)",
					"entries": [
						"Ssendam forces every creature suffering from madness within 60 feet of her to use their reaction to attack another creature within 5 feet of them."
					]
				}
			],
			"legendaryGroup": {
				"name": "Ssendam, Lord of Madness",
				"source": "MaBJoV"
			},
			"traitTags": [
				"Legendary Resistances",
				"Magic Resistance",
				"Magic Weapons",
				"Regeneration",
				"Shapechanger"
			],
			"senseTags": [
				"B",
				"U"
			],
			"actionTags": [
				"Multiattack",
				"Teleport"
			],
			"languageTags": [
				"XX",
				"TP"
			],
			"spellcastingTags": [
				"I"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflictSpell": [
				"frightened",
				"stunned"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MaBJoV/Ssendam, Lord of Madness.png",
			"fluff": {
				"name": "Ssendam, Lord of Madness",
				"source": "MaBJoV",
				"entries": [
					{
						"type": "quote",
						"entries": [
							"The lord of insanity is a difficult subject to find accurate information on. Mainly because most that encounter the primal slaad are left either catatonic, incoherent or psychotic. Ssendam is one of the two known slaadi lords, the other being Ygorl, lord of entropy. There are rumors of other slaadi that may rival the power of Ssendam and Ygorl. Netherese texts refer to them as void slaad and chronal slaad."
						],
						"by": "Volo"
					},
					"Ssendam is the Slaad Lord of Madness. She was born in the ancient days, when Primus, Lord of the Modrons, came to Limbo to bring order to chaos with his Spawning Stone. A shard of the Spawning Stone broke off in the god's hand and worked its way into his divine body. The wound made him feverish and clouded his thoughts; this was the first instance of what is now known as the chaos phage or \"slaad fever\".",
					"Not wanting to bring the illness to his home plane of Mechanus, Primus purged himself before leaving Limbo. Not only did he expel the shard, but all the chaos that had touched his body, in a pile of vile excrement. Through the power of the Spawning Stone, this excrement transformed itself into the first slaad—Ssendam.",
					"Ssendam is not interested in the realm of Limbo. Her only desire is to spread sickness and madness. To this end she travels to different mortal worlds, bringing with her the chaos phage. She has two forms, that of a golden amoeba or alternatively that of a golden slaad. As an amoeba, Ssendam moves through the waters of a mortal world, looking for a perfect host. When she finds that host, she allows her target to consume her by drinking water or wine. She then infects her host's mind and slowly turns them toward madness. This madness leads to an obsession with the slaad, the chaos phage, and Limbo.",
					"Eventually, the host will find a way to bring slaad into their world. When there are enough of her kind, Ssendam completes her corruption of the host and transforms into her golden slaad form, utterly consuming her unfortunate living vessel. Her only goal after this transformation is spread the chaos phage to all corners of the world she now inhabits.",
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Lair Actions",
								"entries": [
									"On initiative count 20 (losing initiative ties), Ssendam can take one lair action to cause one of the following effects; Ssendam can't use the same effect two rounds in a row:",
									{
										"type": "list",
										"items": [
											"All creatures within 30 ft. of Ssendam must succeed on a DC 20 Wisdom saving throw or come under the effects of the {@spell confusion} spell until the end of its next turn.",
											"Until the end of Ssendam's next turn, any creature that casts a spell within 60 ft. of Ssendam must roll on the sorcerer's wild surge table in the PHB."
										]
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Regional Effects",
								"entries": [
									"The region containing Ssendam's lair is corrupted by the chaos phage, which creates one or more of the following effects:",
									{
										"type": "list",
										"items": [
											"Within 1 mile of Ssendam's lair, there is a 1 in 20 chance that any creature that casts a spell must roll on the sorcerer's wild surge table in the PHB.",
											"Within 10 miles of the lair, any creature that takes a long or short rest must succeed on a DC 20 Wisdom saving throw or be inflicted with a random shortterm madness."
										]
									},
									"If Ssendam dies, the effects fade over the course of {@dice 1d10} days."
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MaBJoV/Ssendam, Lord of Madness.webp"
						}
					}
				]
			},
			"damageTags": [
				"B",
				"N",
				"S"
			],
			"damageTagsSpell": [
				"F",
				"N",
				"R"
			],
			"savingThrowForced": [
				"charisma"
			],
			"savingThrowForcedSpell": [
				"charisma",
				"constitution",
				"dexterity",
				"wisdom"
			],
			"savingThrowForcedLegendary": [
				"wisdom"
			],
			"uniqueId": "c507063a-0bda-4760-b888-c2ea2b0d8e58"
		},
		{
			"name": "Mummy",
			"source": "CM-M",
			"page": 1,
			"basicRules": true,
			"size": [
				"M"
			],
			"type": "undead",
			"alignment": [
				"L",
				"E"
			],
			"ac": [
				{
					"ac": 11,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 58,
				"formula": "9d8 + 18"
			},
			"speed": {
				"walk": 20
			},
			"str": 16,
			"dex": 8,
			"con": 15,
			"int": 6,
			"wis": 10,
			"cha": 12,
			"save": {
				"wis": "+2"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks",
					"cond": true
				}
			],
			"immune": [
				"necrotic",
				"poison"
			],
			"vulnerable": [
				"fire"
			],
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"frightened",
				"paralyzed",
				"poisoned"
			],
			"languages": [
				"the languages it knew in life"
			],
			"cr": "3",
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The mummy can use its Dreadful Glare and makes one attack with its rotting fist, or two attacks with its rotting fist."
					]
				},
				{
					"name": "Rotting Fist",
					"entries": [
						"{@atk mw} {@hit 6} to hit, reach 5 ft., one target. {@h}10 ({@damage 2d6 + 3}) bludgeoning damage plus 10 ({@damage 3d6}) necrotic damage. If the target is a creature, it must succeed on a {@dc 11} Constitution saving throw or be cursed with mummy rot. The cursed target can't regain hit points, and its hit point maximum decreases by 10 ({@dice 3d6}) for every 24 hours that elapse. If the curse reduces the target's hit point maximum to 0, the target dies, and its body turns to dust. The curse lasts until removed by the {@spell remove curse} spell or other magic."
					]
				},
				{
					"name": "Dreadful Glare",
					"entries": [
						"The mummy targets one creature it can see within 60 feet of it. If the target can see the mummy, it must succeed on a {@dc 11} Wisdom saving throw against this magic or become {@condition frightened} until the end of the mummy's next turn. If the target fails the saving throw by 5 or more, it is also {@condition paralyzed} for the same duration. A target that succeeds on the saving throw is immune to the Dreadful Glare of all mummies (but not mummy lords) for the next 24 hours."
					]
				}
			],
			"environment": [
				"desert"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/mummy.mp3"
			},
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"LF"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"frightened",
				"paralyzed"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MM/Mummy.png",
			"fluff": {
				"name": "Mummy",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Raised by dark funerary rituals, a mummy shambles from the shrouded stillness of a time-lost temple or tomb. Having been awoken from its rest, it punishes transgressors with the power of its unholy curse.",
									{
										"name": "Preserved Wrath",
										"type": "entries",
										"entries": [
											"The long burial rituals that accompany a mummy's entombment help protect its body from rot. In the embalming process, the newly dead creature's organs are removed and placed in special jars, and its corpse is treated with preserving oils, herbs, and wrappings. After the body has been prepared, the corpse is typically wrapped in linen bandages."
										]
									},
									{
										"name": "The Will of Dark Gods",
										"type": "entries",
										"entries": [
											"An undead mummy is created when the priest of a death god or other dark deity ritually imbues a prepared corpse with necromantic magic. The mummy's linen wrappings are inscribed with necromantic markings before the burial ritual concludes with an invocation to darkness. As a mummy endures in undeath, it animates in response to conditions specified by the ritual. Most commonly, a transgression against its tomb, treasures, lands, or former loved ones will cause a mummy to rise."
										]
									},
									{
										"name": "The Punished",
										"type": "entries",
										"entries": [
											"Once deceased, an individual has no say in whether or not its body is made into a mummy. Some mummies were powerful individuals who displeased a high priest or pharaoh, or who committed crimes of treason, adultery, or murder. As punishment, they were cursed with eternal undeath, embalmed, mummified, and sealed away. Other times, mummies acting as tomb guardians are created from slaves put to death specifically to serve a greater purpose."
										]
									},
									{
										"name": "Creature of Ritual",
										"type": "entries",
										"entries": [
											"A mummy obeys the conditions and parameters laid down by the rituals that created it, driven only to punish transgressors. The overwhelming terror that foreshadows a mummy's attack can leave the intended victim paralyzed with fright. In the days following a mummy's touch, a victim's body rots from the outside in, until nothing but dust remains."
										]
									},
									{
										"name": "Ending a Mummy's Curse",
										"type": "entries",
										"entries": [
											"Rare magic can undo or dispel the ritual that gave rise to a mummy, allowing it to truly die. More commonly, a mummy can be sent back to its endless rest by undoing the transgression that caused it to rise. A sacred idol might be replaced in its niche, a stolen treasure could be returned to its tomb, or a temple might be purified of despoiling bloodshed.",
											"More ephemeral or permanent offenses, such as revealing a secret the mummy wished kept or killing an individual the mummy loved, can't be so easily remedied. In such cases, a mummy might slaughter all the creatures responsible and still not sate its wrath."
										]
									},
									{
										"name": "Undead Archives",
										"type": "entries",
										"entries": [
											"Though they seldom bother to do so, mummies can speak. As a result, some serve as undead repositories of lost lore, and can be consulted by the descendants of those who created them. Powerful individuals sometimes intentionally sequester mummies away for occasional consultation."
										]
									},
									{
										"name": "Undead Nature",
										"type": "entries",
										"entries": [
											"A mummy doesn't require air, food, drink, or sleep."
										]
									}
								]
							},
							{
								"type": "insetReadaloud",
								"entries": [
									{
										"type": "quote",
										"entries": [
											"Before opening a sarcophagus, light a torch."
										],
										"by": "X the Mystic's 7th rule of dungeon survival"
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Mummy.jpg"
						}
					}
				]
			},
			"damageTags": [
				"B",
				"N"
			],
			"savingThrowForced": [
				"constitution",
				"wisdom"
			],
			"uniqueId": "b2fefa08-1889-44b6-b4fd-9354ba4c9929"
		},
		{
			"name": "Canopic Golem",
			"source": "CM-M",
			"page": 1,
			"size": [
				"L"
			],
			"type": "construct",
			"ac": [
				{
					"ac": 18,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "15d10 + 75",
				"average": 157
			},
			"speed": {
				"walk": 30
			},
			"str": 20,
			"dex": 10,
			"con": 20,
			"int": 7,
			"wis": 11,
			"cha": 1,
			"save": {
				"int": "+3",
				"wis": "+5",
				"cha": "+0"
			},
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 10,
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"blinded",
				"charmed",
				"deafened",
				"exhaustion",
				"frightened",
				"paralyzed",
				"petrified",
				"poisoned"
			],
			"cr": "13",
			"trait": [
				{
					"name": "Limited Spell Immunity",
					"entries": [
						"The golem automatically succeeds on saving throws against spells of 7th level or lower, and the attack rolls of such spells always miss it."
					]
				},
				{
					"name": "Unusual Nature",
					"entries": [
						"The golem doesn't require air, food, drink, or sleep."
					]
				},
				{
					"name": "Immutable Form",
					"entries": [
						"The canopic golem is immune to any spell or effect that would alter its form."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The golem makes two attacks."
					]
				},
				{
					"name": "Slam",
					"entries": [
						"{@atk mw} {@hit 10} to hit, reach 5 ft., one target. {@h}27 ({@damage 4d10 + 5}) force damage."
					]
				},
				{
					"name": "Crystal Dart",
					"entries": [
						"{@atk rw} {@hit 10} to hit, range 120 ft., one target. {@h}18 ({@damage 3d8 + 5}) force damage."
					]
				},
				{
					"name": "Whelm (Water)",
					"entries": [
						"Each creature within 10 feet that the canopic golem chooses must make a {@dc 17} Strength saving throw. On a failure, a target takes 13 ({@damage 2d8 + 5}) cold damage. If it is Large or smaller, it is also {@condition grappled} (escape {@dc 15}). Until this grapple ends, the target is {@condition restrained}, and at the start canopic golem's turns, each target takes 13 ({@damage 2d8 + 5}) cold damage.",
						"If the saving throw is successful, the target takes half damage and is not {@condition grappled}."
					]
				},
				{
					"name": "Whirlwind (Air)",
					"entries": [
						"Each creature within 10 feet that the canopic golem chooses must make a {@dc 17} Strength saving throw. On a failure, a target takes 15 ({@damage 3d8 + 5}) bludgeoning damage and is flung up 20 feet away from the canopic golem in a random direction and knocked {@condition prone}. If a thrown target strikes an object, such as a wall or floor, the target takes ({@damage 2d6}) bludgeoning damage. If the target is thrown at another creature, that creature must succeed on a {@dc 13} Dexterity saving throw or take the same damage and be knocked {@condition prone}.",
						"If the saving throw is successful, the target takes half the bludgeoning damage and isn't flung away or knocked {@condition prone}."
					]
				},
				{
					"name": "Enflame (Fire)",
					"entries": [
						"Each creature within 10 feet of the canopic golem must make a {@dc 17} Dexterity saving throw. On a failure, a target takes 27 ({@damage 5d8+5}) fire damage, or half as much on a success.",
						"For the next minute, any creature that starts its turn within 10 feet of the canopic golem takes 6 ({@damage 1d12}) fire damage."
					]
				}
			],
			"reaction": [
				{
					"name": "Spell Deflection",
					"entries": [
						"In response to a spell attack missing the golem, it causes that spell to hit another creature within 120 feet of it that it can see."
					]
				}
			],
			"traitTags": [
				"Immutable Form",
				"Unusual Nature"
			],
			"senseTags": [
				"SD"
			],
			"actionTags": [
				"Multiattack"
			],
			"miscTags": [
				"MW",
				"RW",
				"AOE"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/CM/Canopic Golem.png",
			"fluff": {
				"name": "Canopic Golem",
				"source": "CM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"A mummy lord's organs, normally stored in sacred canopic jars during mummification, can be magically preserved and transplanted into living humanoids. The transplant recipients come under the control of the mummy lord, either as living supplicants or mindless golems through which the mummy lord can see and speak."
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/CM/Canopic Golem.jpg"
						}
					}
				]
			},
			"conditionInflict": [
				"grappled",
				"prone",
				"restrained"
			],
			"attachedItems": [
				"whelm|dmg"
			],
			"damageTags": [
				"B",
				"C",
				"F",
				"O"
			],
			"savingThrowForced": [
				"dexterity",
				"strength"
			],
			"uniqueId": "e8c9d4ad-ee63-4b05-9bf5-efcd5d318f88"
		},
		{
			"name": "Barrowghast",
			"source": "CM-M",
			"page": 1,
			"size": [
				"H"
			],
			"type": "undead",
			"alignment": [
				"C",
				"E"
			],
			"alignmentPrefix": "typically ",
			"ac": [
				{
					"ac": 12,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 138,
				"formula": "12d12 + 60"
			},
			"speed": {
				"walk": 40
			},
			"str": 21,
			"dex": 8,
			"con": 20,
			"int": 5,
			"wis": 9,
			"cha": 6,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 9,
			"resist": [
				"necrotic",
				"poison"
			],
			"conditionImmune": [
				"exhaustion",
				"poisoned"
			],
			"languages": [
				"Giant"
			],
			"cr": "7",
			"trait": [
				{
					"name": "Stench",
					"entries": [
						"Any creature that starts its turn within 10 feet of the barrowghast must make a {@dc 16} Constitution saving throw. On a failed save, the creature has the {@condition poisoned} condition for 1 minute. While {@condition poisoned} this way, the creature can't regain hit points. The creature may repeat the saving throw at the end of each of their turns. On a successful save, the creature is immune to the Stench of all barrowghasts for 24 hours."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The barrowghast makes two Slam attacks. It can replace one Slam attack with a Life Drain attack."
					]
				},
				{
					"name": "Slam",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 10 ft., one target. {@h}18 ({@damage 2d12 + 5}) bludgeoning damage."
					]
				},
				{
					"name": "Life Drain",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 10 ft., one creature. {@h}9 ({@damage 1d8 + 5}) necrotic damage, and the target must succeed on a {@dc 16} Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.",
						"A Humanoid slain by this attack immediately rises as a zombie (see the Monster Manual). The zombie acts as an ally of the barrowghast but isn't under its control."
					]
				}
			],
			"reaction": [
				{
					"name": "Noxious Wound",
					"entries": [
						"Immediately after the barrowghast takes piercing or slashing damage, poisonous ichor sprays from the wound. Each creature within 10 feet of the barrowghast must make a {@dc 16} Dexterity saving throw, taking 14 ({@damage 4d6}) poison damage on a failed save, or half as much damage on a successful one."
					]
				}
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"GI"
			],
			"miscTags": [
				"MW",
				"RCH",
				"HPR",
				"AOE"
			],
			"conditionInflict": [
				"poisoned"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/BGG/Barrowghast.png",
			"fluff": {
				"name": "Barrowghast",
				"source": "BGG",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"A hill giant who dies with an empty stomach, full of rage and regret, might become suffused with energy from the Negative Plane and rise as a barrowghast. Though it looks like little more than an animated corpse, a barrowghast is filled with necrotic energy and driven by spite and malice. Its blood is a thick and toxic ichor that gives the barrowghast a noxious stench.",
							"Barrowghasts no longer hunger for physical food and instead crave life energy drained from living creatures. They often target former family members and allies, but they feast indiscriminately on any creatures they encounter. When barrowghasts drain Humanoids' life energy, those Humanoids rise as zombies."
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/BGG/Barrowghast.webp"
						}
					}
				]
			},
			"damageTags": [
				"B",
				"I",
				"N"
			],
			"savingThrowForced": [
				"constitution",
				"dexterity"
			],
			"uniqueId": "28989e69-f308-4481-bc37-328634aa2747"
		},
		{
			"name": "Jhaeros",
			"isNamedCreature": true,
			"source": "CM-M",
			"page": 1,
			"size": [
				"L"
			],
			"type": {
				"type": "construct",
				"tags": [
					"drow"
				]
			},
			"alignment": [
				"N",
				"E"
			],
			"ac": [
				{
					"ac": 18,
					"from": [
						"{@item plate armor|PHB|plate}"
					]
				}
			],
			"hp": {
				"formula": "19d10 + 95",
				"average": 200
			},
			"speed": {
				"walk": 30
			},
			"str": 20,
			"dex": 16,
			"con": 20,
			"int": 10,
			"wis": 16,
			"cha": 10,
			"save": {
				"wis": "+7",
				"con": "+9",
				"str": "+9"
			},
			"skill": {
				"athletics": "+9",
				"perception": "+7",
				"survival": "+7",
				"insight": "+7"
			},
			"passive": 17,
			"languages": [
				"Common",
				"Undercommon"
			],
			"cr": "11",
			"trait": [
				{
					"name": "Berserking Greataxe",
					"entries": [
						"{@item +3 greataxe}. Whenever a hostile creature damages Jhaeros while the axe is in his possession, he must succeed on a {@dc 15} Wisdom saving throw or go berserk. He can choose to fail this saving throw. While berserk, Jhaeros gains advantage on all melee attacks and attacks made against him are made with advantage."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If Jhaeros fails a saving throw, it can choose to succeed instead."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Jhaeros makes two attacks with his berserking greataxe."
					]
				},
				{
					"name": "Berserking Great Axe",
					"entries": [
						"{@atk mw} {@hit 11} to hit, reach 5 ft., one target. {@h}14 ({@damage 1d12 + 8}) slashing damage."
					]
				},
				{
					"name": "Heavy Crossbow",
					"entries": [
						"{@atk rw} {@hit 7} to hit, range 100/400 ft., one target. {@h}6 ({@damage 1d10 + 3}) piercing damage."
					]
				}
			],
			"legendary": [
				{
					"name": "Weapon Attack",
					"entries": [
						"Jhaeros makes an attack with a melee weapon."
					]
				},
				{
					"name": "Berserk Whirlwind (Costs 3 Actions)",
					"entries": [
						"Jhaeros makes a weapon attack against every creature within 5 ft. of him."
					]
				}
			],
			"attachedItems": [
				"heavy crossbow|phb"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"C",
				"U"
			],
			"miscTags": [
				"MW",
				"RW",
				"MLW"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MaBJoV/Kagain.png",
			"fluff": {
				"images": [
					{
						"type": "image",
						"href": {
							"type": "external",
							"url": "https://5e.tools/img/bestiary/MaBJoV/Kagain.webp"
						}
					}
				]
			},
			"senses": [
				"darkvision 60 ft."
			],
			"senseTags": [
				"D"
			],
			"traitTags": [
				"Legendary Resistances"
			],
			"resist": [
				"fire",
				"necrotic",
				"psychic"
			],
			"conditionImmune": [
				"blinded",
				"charmed",
				"exhaustion",
				"frightened",
				"paralyzed",
				"petrified",
				"poisoned"
			],
			"damageTags": [
				"P",
				"S"
			],
			"savingThrowForced": [
				"wisdom"
			],
			"uniqueId": "8d4b5b8e-e85c-4cd3-a43d-825ea3a6b98e"
		},
		{
			"name": "Four-Armed Gargoyle",
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": "elemental",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"average": 63,
				"formula": "7d8 + 21"
			},
			"speed": {
				"walk": 30,
				"fly": 60
			},
			"str": 15,
			"dex": 11,
			"con": 16,
			"int": 6,
			"wis": 11,
			"cha": 7,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 10,
			"resist": [
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks that aren't adamantine",
					"cond": true
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"exhaustion",
				"petrified",
				"poisoned"
			],
			"languages": [
				"Terran"
			],
			"cr": "4",
			"trait": [
				{
					"name": "False Appearance",
					"entries": [
						"While the gargoyle remains motionless, it is indistinguishable from an inanimate statue."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The gargoyle makes four attacks with its claws."
					]
				},
				{
					"name": "Claws",
					"entries": [
						"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}9 ({@damage 2d6 + 2}) slashing damage."
					]
				}
			],
			"traitTags": [
				"False Appearance"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"T"
			],
			"miscTags": [
				"MW"
			],
			"tokenUrl": "https://5e.tools/img/TftYP/Four-Armed Gargoyle.png",
			"damageTags": [
				"S"
			],
			"uniqueId": "bdcc9f80-8da6-4605-b8b6-5969fa244c3e"
		},
		{
			"name": "Charmayne Daymore",
			"isNpc": true,
			"isNamedCreature": true,
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": {
				"type": "elemental",
				"tags": [
					"wizard"
				]
			},
			"alignment": [
				"N",
				"E"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"Mage Armor"
					]
				}
			],
			"hp": {
				"formula": "25d6 + 75",
				"average": 162
			},
			"speed": {
				"walk": 30,
				"fly": {
					"number": 30,
					"condition": "(hover)"
				},
				"canHover": true
			},
			"str": 8,
			"dex": 14,
			"con": 16,
			"int": 20,
			"wis": 16,
			"cha": 16,
			"save": {
				"int": "+9",
				"cha": "+7",
				"wis": "+7"
			},
			"skill": {
				"arcana": "+9",
				"deception": "+7",
				"perception": "+6"
			},
			"passive": 16,
			"immune": [
				"poison"
			],
			"languages": [
				"Common",
				"Draconic",
				"Elvish",
				"Ignan"
			],
			"cr": "10",
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"Charmayne casts one of the following spells, using Intelligence as the spellcasting ability (spell save {@dc 17}):"
					],
					"will": [
						"{@spell dancing lights}",
						"{@spell mage hand}"
					],
					"daily": {
						"3": [
							"{@spell mage armor}"
						],
						"1e": [
							"{@spell counterspell}",
							"{@spell dispel magic}",
							"{@spell fire storm}",
							"{@spell invisibility}",
							"{@spell polymorph}"
						]
					},
					"ability": "int",
					"type": "spellcasting"
				}
			],
			"trait": [
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If Charmayne fails a saving throw, she can choose to succeed instead."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Charmayne makes three Ashen Burst attacks. She can replace one of these attacks with one use of Spellcasting."
					]
				},
				{
					"name": "Ashen Burst",
					"entries": [
						"{@atk ms,rs} {@hit 9} to hit, reach 5 ft. or range 60 ft., one target. {@h}17 ({@damage 5d6}) fire damage."
					]
				},
				{
					"name": "Cinder Spite {@recharge 5}",
					"entries": [
						"Charmayne creates a magical explosion of fire centered on a point she can see within 120 feet of herself. Each creature in a 20-foot-radius sphere centered on that point must make a {@dc 17} Dexterity saving throw, taking 35 ({@damage 10d6}) fire damage on a failed save, or half as much damage on a successful one. A Humanoid reduced to 0 hit points by this damage dies and is transformed into a Tiny charcoal figurine."
					]
				}
			],
			"reaction": [
				{
					"name": "Charmayne can take up to three reactions per round but only one per turn.",
					"entries": []
				},
				{
					"name": "Elemental Rebuke",
					"entries": [
						"In response to being hit by an attack, Charmayne utters a word in Ignan, dealing 10 ({@damage 3d6}) fire damage to the attacker. Charmayne then teleports, along with any equipment she is wearing or carrying, up to 30 feet to an unoccupied space she can see, leaving a harmless cloud of ash and embers in the space she just left."
					]
				}
			],
			"traitTags": [
				"Legendary Resistances"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"C",
				"DR",
				"E",
				"IG"
			],
			"spellcastingTags": [
				"O"
			],
			"miscTags": [
				"AOE"
			],
			"conditionInflictSpell": [
				"invisible"
			],
			"hasFluff": true,
			"tokenUrl": "https://5e.tools/img/KftGV/Charmayne Daymore.png",
			"fluff": {
				"name": "Charmayne Daymore",
				"source": "KftGV",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"A powerful spellcaster, Charmayne had become jealous of the king's passion and warmth. Longing to possess those qualities, she painstakingly created rituals to drain Jhaeros's vitality and charm, and to funnel these qualities into herself. However, the magic only enhanced her greed and jealousy; the more she took from Jhaeros, the hungrier for power Charmayne became, going so far as to murder her fellow councilor, Regine, while she slept.",
							"As she came to realize the people of Ghalasine didn't love her as they did the king, Charmayne became filled with rage. She used magic to tear out Jhaeros's heart while keeping it alive. She then used the still-beating heart as the focus of a ritual to destroy Ghalasine."
						]
					}
				]
			},
			"resist": [
				"fire"
			],
			"conditionImmune": [
				"charmed",
				"poisoned"
			],
			"damageTags": [
				"F"
			],
			"damageTagsSpell": [
				"F"
			],
			"savingThrowForced": [
				"dexterity"
			],
			"savingThrowForcedSpell": [
				"dexterity",
				"wisdom"
			],
			"uniqueId": "c0e9c307-348c-4e41-bc76-4509df0079b7"
		},
		{
			"name": "Zikzokrishka",
			"group": [
				"Chromatic Dragon"
			],
			"source": "CM-M",
			"page": 1,
			"size": [
				"G"
			],
			"type": "dragon",
			"alignment": [
				"L",
				"E"
			],
			"ac": [
				{
					"ac": 20,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "40d20 + 320",
				"average": 740
			},
			"speed": {
				"walk": 40,
				"burrow": 40,
				"fly": 80
			},
			"str": 26,
			"dex": 12,
			"con": 26,
			"int": 18,
			"wis": 20,
			"cha": 20,
			"save": {
				"dex": "+7",
				"wis": "+11",
				"cha": "+11",
				"con": "+14"
			},
			"skill": {
				"insight": "+11",
				"investigation": "+10",
				"perception": "+17",
				"stealth": "+7"
			},
			"senses": [
				"blindsight 60 ft.",
				"darkvision 120 ft."
			],
			"passive": 27,
			"immune": [
				"lightning"
			],
			"languages": [
				"Common",
				"Draconic"
			],
			"cr": "23",
			"trait": [
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the dragon fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Mythic Awakening",
					"entries": [
						"If the dragon is reduced to below half hit points, it recharges its Breath Weapon and regains any expended uses of Legendary Resistance. Additionally, the dragon can now use the options in the \"Mythic Actions\" section for 1 hour."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The dragon one Bite attack and two Claw attacks."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 14} to hit, reach 15 ft., one target. {@h}19 ({@damage 2d10 + 8}) piercing damage plus 11 ({@damage 2d10}) lightning damage."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 14} to hit, reach 10 ft., one target. {@h}15 ({@damage 2d6 + 8}) slashing damage."
					]
				},
				{
					"name": "Tail",
					"entries": [
						"{@atk mw} {@hit 14} to hit, reach 20 ft., one target. {@h}17 ({@damage 2d8 + 8}) bludgeoning damage."
					]
				},
				{
					"name": "Lightning Spear",
					"entries": [
						"{@atk rw} {@hit 14} to hit, reach 120 ft., four targets. {@h}13 ({@damage 1d8+ 8}) lightning damage."
					]
				},
				{
					"name": "Lightning Breath {@recharge 5}",
					"entries": [
						"The dragon exhales lightning in a 90-foot cone. Each creature in that line must make a {@dc 21} Dexterity saving throw, taking 56 ({@damage 16d6}) lightning damage on a failed save, or half as much damage on a successful one."
					]
				}
			],
			"legendary": [
				{
					"name": "Detect",
					"entries": [
						"The dragon makes a Wisdom ({@skill Perception}) check."
					]
				},
				{
					"name": "Tail Attack",
					"entries": [
						"The dragon makes a tail attack."
					]
				},
				{
					"name": "Wing Attack (Costs 2 Actions)",
					"entries": [
						"The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a {@dc 22} Dexterity saving throw or take 15 ({@damage 2d6 + 8}) bludgeoning damage and be knocked {@condition prone}. The dragon can then fly up to half its flying speed."
					]
				},
				{
					"name": "Lightning Spear (Costs 3 Actions).",
					"entries": [
						"The dragon makes a lightning spear attack."
					]
				}
			],
			"legendaryGroup": {
				"name": "Blue Dragon",
				"source": "MM"
			},
			"environment": [
				"coastal",
				"desert"
			],
			"dragonCastingColor": "blue",
			"dragonAge": "ancient",
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/blue-dragon.mp3"
			},
			"traitTags": [
				"Legendary Resistances"
			],
			"senseTags": [
				"B",
				"SD"
			],
			"actionTags": [
				"Breath Weapon",
				"Frightful Presence",
				"Multiattack"
			],
			"languageTags": [
				"C",
				"DR"
			],
			"miscTags": [
				"MW",
				"RCH",
				"RW",
				"MLW",
				"THW",
				"AOE"
			],
			"conditionInflict": [
				"prone"
			],
			"conditionInflictLegendary": [
				"blinded",
				"prone",
				"restrained"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MM/Ancient Blue Dragon.png",
			"fluff": {
				"name": "Ancient Blue Dragon",
				"source": "MM",
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Ancient Blue Dragon.webp"
						}
					}
				],
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Vain and territorial, blue dragons soar through the skies over deserts, preying on caravans and plundering herds and settlements in the verdant lands beyond the desert's reach. These dragons can also be found in dry steppes, searing badlands, and rocky coasts. They guard their territories against all potential competitors, especially brass dragons.",
									"A blue dragon is recognized by its dramatic frilled ears and the massive ridged horn atop its blunt head. Rows of spikes extend back from its nostrils to line its brow, and cluster on its jutting lower jaw.",
									"A blue dragon's scales vary in color from an iridescent azure to a deep indigo, polished to a glossy finish by the desert sands. As the dragon ages, its scales become thicker and harder, and its hide hums and crackles with static electricity. These effects intensify when the dragon is angry or about to attack, giving off an odor of ozone and dusty air.",
									{
										"name": "Vain and Deadly",
										"type": "entries",
										"entries": [
											"A blue dragon will not stand for any remark or insinuation that it is weak or inferior, taking great pleasure in lording its power over humanoids and other lesser creatures.",
											"A blue dragon is a patient and methodical combatant. When fighting on its own terms, it turns combat into an extended affair of hours or even days, attacking from a distance with volleys of lightning, then flying well out of harm's reach as it waits to attack again."
										]
									},
									{
										"name": "Desert Predators",
										"type": "entries",
										"entries": [
											"Though they sometimes eat cacti and other desert plants to sate their great hunger, blue dragons are carnivores. They prefer to dine on herd animals, cooking those creatures with their lightning breath before gorging themselves. Their dining habits make blue dragons an enormous threat to desert caravans and nomadic tribes, which become convenient collections of food and treasure to a dragon's eye.",
											"When it hunts, a blue dragon buries itself in the desert sand so that only the horn on its nose pokes above the surface, appearing to be an outcropping of stone. When prey draws near, the dragon rises up, sand pouring from its wings like an avalanche as it attacks."
										]
									},
									{
										"name": "Overlords and Minions",
										"type": "entries",
										"entries": [
											"Blue dragons covet valuable and talented creatures whose service reinforces their sense of superiority. Bards, sages, artists, wizards, and assassins can become valuable agents for a blue dragon, which rewards loyal service handsomely.",
											"A blue dragon keeps its lair secret and well protected, and even its most trusted servants are rarely allowed within. It encourages ankhegs, giant scorpions, and other creatures of the desert to dwell near its lair for additional security. Older blue dragons sometimes attract air elementals and other creatures to serve them."
										]
									},
									{
										"name": "Hoarders of Gems",
										"type": "entries",
										"entries": [
											"Though blue dragons collect anything that looks valuable, they are especially fond of gems. Considering blue to be the most noble and beautiful of colors, they covet sapphires, favoring jewelery and magic items adorned with those gems.",
											"A blue dragon buries its most valuable treasures deep in the sand, while scattering a few less valuable trinkets in plainer sight over hidden sinkholes to punish and eliminate would-be thieves."
										]
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"name": "A Blue Dragon's Lair",
						"entries": [
							"Blue dragons make their lairs in barren places, using their lightning breath and their burrowing ability to carve out crystallized caverns and tunnels beneath the sands.",
							"Thunderstorms rage around a legendary blue dragon's lair, and narrow tubes lined with glassy sand ventilate the lair, all the while avoiding the deadly sinkholes that are the dragon's first line of defense.",
							"A blue dragon will collapse the caverns that make up its lair if that lair is invaded. The dragon then burrows out, leaving its attackers to be crushed and suffocated. When it returns later, it collects its possessions-along with the wealth of the dead intruders."
						]
					},
					{
						"type": "entries",
						"name": "Chromatic Dragons",
						"entries": [
							"The black, blue, green, red, and white dragons represent the evil side of dragonkind. Aggressive, gluttonous, and vain, chromatic dragons are dark sages and powerful tyrants feared by all creatures-including each other.",
							{
								"type": "entries",
								"entries": [
									{
										"name": "Driven by Greed",
										"entries": [
											"Chromatic dragons lust after treasure, and this greed colors their every scheme and plot. They believe that the world's wealth belongs to them by right, and a chromatic dragon seizes that wealth without regard for the humanoids and other creatures that have \"stolen\" it. With its piles of coins, gleaming gems, and magic items, a dragon's hoard is the stuff of legend. However, chromatic dragons have no interest in commerce, amassing wealth for no other reason than to have it."
										],
										"type": "entries"
									},
									{
										"name": "Creatures of Ego",
										"type": "entries",
										"entries": [
											"Chromatic dragons are united by their sense of superiority, believing themselves the most powerful and worthy of all mortal creatures. When they interact with other creatures, it is only to further their own interests. They believe in their innate right to rule, and this belief is the cornerstone of every chromatic dragon's personality and worldview. Trying to humble a chromatic dragon is like trying to convince the wind to stop blowing. To these creatures, humanoids are animals, fit to serve as prey or beasts of burden, and wholly unworthy of respect."
										]
									},
									{
										"name": "Dangerous Lairs",
										"type": "entries",
										"entries": [
											"A dragon's lair serves as the seat of its power and a vault for its treasure. With its innate toughness and tolerance for severe environmental effects, a dragon selects or builds a lair not for shelter but for defense, favoring multiple entrances and exits, and security for its hoard.",
											"Most chromatic dragon lairs are hidden in dangerous and remote locations to prevent all but the most audacious mortals from reaching them. A black dragon might lair in the heart of a vast swamp, while a red dragon might claim the caldera of an active volcano. In addition to the natural defenses of their lairs, powerful chromatic dragons use magical guardians, traps, and subservient creatures to protect their treasures."
										]
									},
									{
										"name": "Queen of Evil Dragons",
										"type": "entries",
										"entries": [
											"Tiamat the Dragon Queen is the chief deity of evil dragonkind. She dwells on Avernus, the first layer of the Nine Hells. As a lesser god, Tiamat has the power to grant spells to her worshipers, though she is loath to share her power. She epitomizes the avarice of evil dragons, believing that the multiverse and all its treasures will one day be hers and hers alone.",
											"Tiamat is a gigantic dragon whose five heads reflect the forms of the chromatic dragons that worship her-black, blue, green, red, and white. She is a terror on the battlefield, capable of annihilating whole armies with her five breath weapons, her formidable spellcasting, and her fearsome claws.",
											"Tiamat's most hated enemy is Bahamut the Platinum Dragon, with whom she shares control of the faith of dragonkind. She also holds a special enmity for Asmodeus, who long ago stripped her of the rule of Avernus and who continues to curb the Dragon Queen's power."
										]
									}
								]
							}
						]
					},
					{
						"type": "section",
						"name": "Dragons",
						"entries": [
							"True dragons are winged reptiles of ancient lineage and fearsome power. They are known and feared for their predatory cunning and greed, with the oldest dragons accounted as some of the most powerful creatures in the world. Dragons are also magical creatures whose innate power fuels their dreaded breath weapons and other preternatural abilities.",
							"Many creatures, including wyverns and dragon turtles, have draconic blood. However, true dragons fall into the two broad categories of chromatic and metallic dragons. The black, blue, green, red, and white dragons are selfish, evil, and feared by all. The brass, bronze, copper, gold, and silver dragons are noble, good, and highly respected by the wise.",
							"Though their goals and ideals vary tremendously, all true dragons covet wealth, hoarding mounds of coins and gathering gems, jewels, and magic items. Dragons with large hoards are loath to leave them for long, venturing out of their lairs only to patrol or feed.",
							"True dragons pass through four distinct stages of life, from lowly wyrmlings to ancient dragons, which can live for over a thousand years. In that time, their might can become unrivaled and their hoards can grow beyond price.",
							{
								"type": "table",
								"caption": "Dragon Age Categories",
								"colLabels": [
									"Category",
									"Size",
									"Age Range"
								],
								"colStyles": [
									"col-4",
									"col-4",
									"col-4"
								],
								"rows": [
									[
										"Wyrmling",
										"Medium",
										"5 years or less"
									],
									[
										"Young",
										"Large",
										"6–100 years"
									],
									[
										"Adult",
										"Huge",
										"101–800 years"
									],
									[
										"Ancient",
										"Gargantuan",
										"801 years or more"
									]
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Lair Actions",
								"entries": [
									"On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:",
									{
										"type": "list",
										"items": [
											"Part of the ceiling collapses above one creature that the dragon can see within 120 feet of it. The creature must succeed on a {@dc 15} Dexterity saving throw or take 10 ({@damage 3d6}) bludgeoning damage and be knocked {@condition prone} and buried. The buried target is {@condition restrained} and unable to breathe or stand up. A creature can take an action to make a {@dc 10} Strength check, ending the buried state on a success.",
											"A cloud of sand swirls about in a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The cloud spreads around corners. Each creature in the cloud must succeed on a {@dc 15} Constitution saving throw or be {@condition blinded} for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
											"Lightning arcs, forming a 5-foot-wide line between two of the lair's solid surfaces that the dragon can see. They must be within 120 feet of the dragon and 120 feet of each other. Each creature in that line must succeed on a {@dc 15} Dexterity saving throw or take 10 ({@damage 3d6}) lightning damage."
										]
									},
									{
										"type": "entries",
										"name": "Additional Lair Actions",
										"entries": [
											"At your discretion, a legendary ({@creature Adult Blue Dragon||adult} or {@creature Ancient Blue Dragon||ancient}) blue dragon can use one or both of the following additional lair actions while in its lair:",
											{
												"type": "list",
												"style": "list-hang-notitle",
												"items": [
													{
														"type": "item",
														"name": "Misleading Mirage",
														"entry": "Until initiative count 20 on the next round, at each intersection or branching passage in the lair, a creature other than the dragon has a {@chance 50|50 percent} chance of going in a different direction from the direction it intends."
													},
													{
														"type": "item",
														"name": "Sudden Sinkhole",
														"entry": "The dragon chooses a point on the ground that it can see within 120 feet of it. A 5-foot-radius, 20-foot-deep pit forms centered on that point. A creature on the ground above where the pit formed must make a DC 15 Dexterity saving throw. On a failed save, a creature falls to the bottom of the pit, taking 7 ({@damage 2d6}) bludgeoning damage and landing {@condition prone}. On a successful save, a creature moves to the nearest unoccupied space instead of falling in the pit."
													}
												]
											}
										],
										"source": "FTD"
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"name": "Regional Effects",
								"entries": [
									"The region containing a legendary blue dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:",
									{
										"type": "list",
										"items": [
											"Thunderstorms rage within 6 miles of the lair.",
											"Dust devils scour the land within 6 miles of the lair. A dust devil has the statistics of an air elemental, but it can't fly, has a speed of 50 feet, and has an Intelligence and Charisma of 1 (-5).",
											"Hidden sinkholes form in and around the dragon's lair. A sinkhole can be spotted from a safe distance with a successful {@dc 20} Wisdom ({@skill Perception}) check. Otherwise, the first creature to step on the thin crust covering the sinkhole must succeed on a {@dc 15} Dexterity saving throw or fall {@dice 1d6 × 10} feet into the sinkhole."
										]
									},
									"If the dragon dies, the dust devils disappear immediately, and the thunderstorms abate within {@dice 1d10} days. Any sinkholes remain where they are.",
									{
										"type": "entries",
										"name": "Additional Regional Effects",
										"entries": [
											"Any of these effects might appear in the area around a blue dragon's lair, in addition to or instead of the effects described in the {@i Monster Manual}:",
											{
												"type": "list",
												"style": "list-hang-notitle",
												"items": [
													{
														"type": "item",
														"name": "Blue Luster",
														"entry": "Creatures that spend a year within 1 mile of the dragon's lair find blue objects fascinating and feel compelled to acquire them at every opportunity."
													},
													{
														"type": "item",
														"name": "Mirage Terrain",
														"entry": "The area immediately surrounding the lair appears to be a lush oasis. A creature carefully examining the illusion can attempt a DC 15 Intelligence ({@skill Investigation}) check to disbelieve it. A creature who disbelieves the illusion sees it as a vague image superimposed on the underlying terrain."
													},
													{
														"type": "item",
														"name": "Sandstorm",
														"entry": "A sandstorm blows constantly within 1 mile of the dragon's lair."
													}
												]
											}
										],
										"source": "FTD"
									}
								]
							}
						]
					}
				]
			},
			"conditionImmune": [
				"charmed",
				"exhaustion",
				"frightened",
				"grappled",
				"poisoned",
				"restrained"
			],
			"isNamedCreature": true,
			"legendaryActions": 3,
			"mythic": [
				{
					"name": "Bite",
					"entries": [
						"The dragon makes one Bite attack."
					]
				},
				{
					"name": "Chromatic Flare (Costs 2 Actions)",
					"entries": [
						"The dragon flares with elemental energy. Each creature in a 60-foot-radius sphere centered on the dragon must succeed on a {@dc 21} Dexterity saving throw or take 18 ({@damage 4d8}) lightning damage."
					]
				}
			],
			"mythicHeader": [
				"If the dragon's Mythic Awakening trait has activated in the last hour, it can use the options below as legendary actions."
			],
			"reaction": [
				{
					"name": "Spell Reflection",
					"entries": [
						"If the dragon makes a successful saving throw against a spell or a spell attack misses it, the dragon can make a Dexterity check with a DC equal to 10 + the spell's level to blow the spell back at a new target. If the spell forces a saving throw, the target makes its own save, or if it was an attack, the attack roll is rerolled at the chosen target."
					]
				}
			],
			"damageTags": [
				"B",
				"L",
				"P",
				"S"
			],
			"damageTagsLegendary": [
				"B",
				"L"
			],
			"savingThrowForced": [
				"dexterity"
			],
			"savingThrowForcedLegendary": [
				"constitution",
				"dexterity"
			],
			"uniqueId": "2677d5ed-401a-429b-8834-a22feeb6f0ee"
		},
		{
			"name": "Flind (melee)",
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": {
				"type": "fiend",
				"tags": [
					"gnoll"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"alignmentPrefix": "Typically ",
			"ac": [
				{
					"ac": 18,
					"from": [
						"{@item plate armor|PHB}"
					]
				}
			],
			"hp": {
				"formula": "12d10 + 72",
				"average": 138
			},
			"speed": {
				"walk": 30
			},
			"str": 20,
			"dex": 16,
			"con": 22,
			"int": 10,
			"wis": 12,
			"cha": 16,
			"skill": {
				"intimidation": "+8",
				"stealth": "+7",
				"athletics": "+9",
				"perception": "+5",
				"survival": "+5"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 15,
			"languages": [
				"Gnoll",
				"Abyssal"
			],
			"cr": "9",
			"trait": [
				{
					"name": "Aura of Sleep",
					"entries": [
						"Any creature other than a flind that starts its turn within 15 feet of the flind must make a {@dc 15} Constitution saving throw. On a failed save, the creature is {@condition unconscious} for one minute. An {@condition unconscious} creature may repeat this saving throw at the end of each of its turns.",
						"If a creature succeeds on any of these saves or the effect ends on it, the creature is immune to Aura of Sleep for the next 24 hours."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The flind only had one kind of flail, but it may make three flail attacks of the same kind."
					]
				},
				{
					"name": "Flail of Pain",
					"entries": [
						"This flail has all kind of shards of glass, metal, bone, etc. all throughout it. {@atk mw} {@hit 9} to hit, reach 10 ft., one target. {@h}10 ({@damage 1d10 + 5}) bludgeoning damage plus 16 ({@damage 3d10}) slashing damage."
					]
				},
				{
					"name": "Flail of Reach",
					"entries": [
						"This flail is longer than a normal flail. {@atk mw} {@hit 9} to hit, reach 20 ft., one target. {@h}16 ({@damage 2d10 + 5}) bludgeoning damage."
					]
				},
				{
					"name": "Flail of Paralysis",
					"entries": [
						"This flail has skulls intertwined in the braids of it. {@atk mw} {@hit 9} to hit, reach 10 ft., one target. {@h}11 ({@damage 1d10 + 5}) bludgeoning damage, and the target must succeed on a {@dc 15} Constitution saving throw or be {@condition paralyzed} until the end of its next turn."
					]
				}
			],
			"environment": [
				"coastal",
				"forest",
				"grassland",
				"hill"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/flind.mp3"
			},
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"OTH",
				"AB"
			],
			"miscTags": [
				"MW",
				"RCH",
				"MLW"
			],
			"conditionInflict": [
				"paralyzed",
				"unconscious"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MPMM/Flind.png",
			"fluff": {
				"name": "Flind",
				"source": "MPMM",
				"entries": [
					"When the demon lord Yeenoghu wants to create a particularly fearsome war band leader, he transforms an excep tionally strong and vicious gnoll into a demonic warrior known as a flind.",
					"A war band of demon-worshiping gnolls typically contains only one flind, and that creature sets the war band's path. Because of its special connection to Yeenoghu, a flind uses demonic insight to guide the gnolls toward weak prey ripe for slaughter.",
					"Unlike other leaders who might skulk behind their minions, a flind leads the charge in battle. Its flail causes wracking pain, paralysis, and disorientation in those it strikes."
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MPMM/Flind.webp"
						},
						"credit": "John Paul Balmet"
					}
				]
			},
			"uniqueId": "fbec4b8c-eca1-4bba-9a5d-786d79d4bc8d",
			"save": {
				"con": "+10",
				"wis": "+5",
				"str": "+9"
			},
			"damageTagsSpell": [
				"B",
				"F",
				"O",
				"P",
				"R"
			],
			"savingThrowForcedSpell": [
				"charisma",
				"constitution",
				"dexterity"
			],
			"damageTags": [
				"B",
				"S"
			],
			"savingThrowForced": [
				"constitution"
			]
		},
		{
			"name": "Balor",
			"source": "CM-M",
			"page": 1,
			"size": [
				"H"
			],
			"type": {
				"type": "fiend",
				"tags": [
					"demon"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 19,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "20d12 + 140",
				"average": 270
			},
			"speed": {
				"walk": 40,
				"fly": 80
			},
			"str": 26,
			"dex": 16,
			"con": 24,
			"int": 18,
			"wis": 16,
			"cha": 22,
			"save": {
				"str": "+14",
				"con": "+13",
				"wis": "+9",
				"cha": "+12"
			},
			"senses": [
				"truesight 120 ft."
			],
			"passive": 19,
			"resist": [
				"cold",
				"lightning",
				{
					"resist": [
						"bludgeoning",
						"piercing",
						"slashing"
					],
					"note": "from nonmagical attacks",
					"cond": true
				}
			],
			"immune": [
				"fire",
				"poison"
			],
			"conditionImmune": [
				"poisoned"
			],
			"languages": [
				"Abyssal",
				"telepathy 120 ft."
			],
			"cr": "19",
			"trait": [
				{
					"name": "Death Throes",
					"entries": [
						"When the balor dies, it explodes, and each creature within 30 feet of it must make a {@dc 20} Dexterity saving throw, taking 70 ({@damage 20d6}) fire damage on a failed save, or half as much damage on a successful one. The explosion ignites flammable objects in that area that aren't being worn or carried, and it destroys the balor's weapons."
					]
				},
				{
					"name": "Fire Aura",
					"entries": [
						"At the start of each of the balor's turns, each creature within 10 feet of it takes 10 ({@damage 3d6}) fire damage, and flammable objects in the aura that aren't being worn or carried ignite. A creature that touches the balor or hits it with a melee attack while within 10 feet of it takes 10 ({@damage 3d6}) fire damage."
					]
				},
				{
					"name": "Magic Resistance",
					"entries": [
						"The balor has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "Magic Weapons",
					"entries": [
						"The balor's weapon attacks are magical."
					]
				},
				{
					"name": "Bloodied",
					"entries": [
						"When the balor becomes blooded (135 HP), he can also make a kick attack with his multiattack."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The balor makes two attacks: one with its longsword and one with its whip."
					]
				},
				{
					"name": "Longsword",
					"entries": [
						"{@atk mw} {@hit 14} to hit, reach 10 ft., one target. {@h}21 ({@damage 3d8 + 8}) slashing damage plus 13 ({@damage 3d8}) lightning damage. If the balor scores a critical hit, it rolls damage dice three times, instead of twice."
					]
				},
				{
					"name": "Whip",
					"entries": [
						"{@atk mw} {@hit 14} to hit, reach 30 ft., one target. {@h}15 ({@damage 2d6 + 8}) slashing damage plus 10 ({@damage 3d6}) fire damage, and the target must succeed on a {@dc 20} Strength saving throw or be pulled up to 25 feet toward the balor."
					]
				},
				{
					"name": "Kick",
					"entries": [
						"{@atk mw} {@hit 14} to hit, reach 10 ft., one target. {@h}28 ({@damage 3d12 + 8}) bludgeoning damage."
					]
				}
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/balor.mp3"
			},
			"attachedItems": [
				"longsword|phb",
				"whip|phb"
			],
			"traitTags": [
				"Death Burst",
				"Magic Resistance",
				"Magic Weapons"
			],
			"senseTags": [
				"U"
			],
			"actionTags": [
				"Multiattack",
				"Teleport"
			],
			"languageTags": [
				"AB",
				"TP"
			],
			"miscTags": [
				"MW",
				"RCH",
				"MLW",
				"AOE"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MM/Balor.png",
			"fluff": {
				"name": "Balor",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Figures of ancient and terrible evil, balors rule as generals over demonic armies, yearning to seize power while destroying any creatures that oppose them.",
									"Wielding a flaming whip and a longsword that channels the power of the storm, a balor's battle prowess is fueled by hatred and rage. It channels this demonic fury in its death throes, falling within a blast of fire that can destroy even the hardiest foes."
								]
							}
						]
					},
					{
						"type": "section",
						"name": "Demons",
						"entries": [
							"Spawned in the Infinite Layers of the Abyss, demons are the embodiment of chaos and evil-engines of destruction barely contained in monstrous form. Possessing no compassion, empathy, or mercy, they exist only to destroy.",
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Spawn of Chaos",
												"entries": [
													"The Abyss creates demons as extensions of itself, spontaneously forming fiends out of filth and carnage. Some are unique monstrosities, while others represent uniform strains virtually identical to each other. Other demons (such as manes) are created from mortal souls shunned or cursed by the gods, or which are otherwise trapped in the Abyss."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Capricious Elevation",
												"entries": [
													"Demons respect power and power alone. A greater demon commands shrieking mobs of lesser demons because it can destroy any lesser demon that dares to refuse its commands. A demon's status grows with the blood it spills; the more enemies that fall before it, the greater it becomes.",
													"A demon might spawn as a manes, then become a dretch, and eventually transform to a vrock after untold time spent fighting and surviving in the Abyss. Such elevations are rare, however, for most demons are destroyed before they attain significant power. The greatest of those that do survive make up the ranks of the demon lords that threaten to tear the Abyss apart with their endless warring.",
													"By expending considerable magical power, demon lords can raise lesser demons into greater forms, though such promotions never stem from a demon's deeds or accomplishments. Rather, a demon lord might warp a manes into a quasit when it needs an invisible spy, or turn an army of dretches into hezrous when marching against a rival lord. Demon lords only rarely elevate demons to the highest ranks, fearful of inadvertently creating rivals to their own power."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Abyssal Invasions",
												"entries": [
													"Wherever they wander across the Abyss, demons search for portals to the other planes. They crave the chance to slip free of their native realm and spread their dark influence across the multiverse, undoing the works of the gods, tearing down civilizations, and reducing the cosmos to despair and ruin.",
													"Some of the darkest legends of the mortal realm are built around the destruction wrought by demons set loose in the world. As such, even nations embroiled in bitter conflict will set their differences aside to help contain an outbreak of demons, or to seal off abyssal breaches before these fiends can break free."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Signs of Corruption",
												"entries": [
													"Demons carry the stain of abyssal corruption with them, and their mere presence changes the world for the worse. Plants wither and die in areas where abyssal breaches and demons appear. Animals shun the sites where a demon has made a kill. The site of a demonic infestation might be fouled by a stench that never abates, by areas of bitter cold or burning heat, or by permanent shadows that mark the places where these fiends lingered."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Eternal Evil",
												"entries": [
													"Outside the Abyss, death is a minor nuisance that no demon fears. Mundane weapons can't stop these fiends, and many demons are resistant to the energy of the most potent spells. When a lucky hero manages to drop a demon in combat, the fiend dissolves into foul ichor. It then instantly reforms in the Abyss, its mind and essence intact even as its hatred is inflamed.",
													"The only way to truly destroy a demon is to seek it in the Abyss and kill it there."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Protected Essence",
												"entries": [
													"A powerful demon can take steps to safeguard its life essence, using secret methods and abyssal metals to create an amulet into which part of that essence is ceded. If the demon's abyssal form is ever destroyed, the amulet allows the fiend to reform at a time and place of its choosing.",
													"Obtaining a demonic amulet is a dangerous enterprise, and simply seeking such a device risks drawing the attention of the demon that created it. A creature possessing a demonic amulet can exact favors from the demon whose life essence the amulet holds—or inflict great pain if the fiend resists. If an amulet is destroyed, the demon that created it is trapped in the Abyss for a year and a day."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Demonic Cults",
												"entries": [
													"Despite the dark risks involved in dealing with fiends, the mortal realm is filled with creatures that covet demonic power. Demon lords manipulate these mortal servants into performing ever greater acts of depravity, furthering the demon lord's ambitions in exchange for magic and other boons. However, a demon regards any mortals in its service as tools to use and then discard at its whim, consigning their mortal souls to the Abyss."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Demon Summoning",
												"entries": [
													"Few acts are as dangerous as summoning a demon, and even mages who bargain freely with devils fear the fiends of the Abyss. Though demons yearn to sow chaos on the Material Plane, they show no gratitude when brought there, raging against their prisons and demanding release.",
													"Those who would risk summoning a demon might do so to wrest information from it, press it into service, or send it on a mission that only a creature of absolute evil can complete. Preparation is key, and experienced summoners know the specific spells and magic items that can force a demon to bend to another's will. If a single mistake is made, a demon that breaks free shows no mercy as it makes its summoner the first victim of its wrath."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Bound Demons",
												"entries": [
													"The Book of Vile Darkness, the Black Scrolls of Ahm, and the Demonomicon of Iggwilv are the foremost authorities on demonic matters. These ancient tomes describe techniques that can trap the essence of a demon on the Material Plane, placing it within a weapon, idol, or piece of jewelry and preventing the fiend's return to the Abyss.",
													"An object that binds a demon must be specially prepared with unholy incantations and innocent blood. It radiates a palpable evil, chilling and fouling the air around it. A creature that handles such an object experiences unsettling dreams and wicked impulses, but is able to control the demon whose essence is trapped within the object. Destroying the object frees the demon, which immediately seeks revenge against its binder."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Demonic Possession",
												"entries": [
													"No matter how secure its bindings, a powerful demon often finds a way to escape an object that holds it. When a demonic essence emerges from its container, it can possess a mortal host. Sometimes a fiend employs stealth to hide a successful possession. Other times, it unleashes the full brunt of its fiendish drives through its new form.",
													"As long as the demon remains in possession of its host, the soul of that host is in danger of being dragged to the Abyss with the demon if it is exorcised from the flesh, or if the host dies. If a demon possesses a creature and the object binding the demon is destroyed, the possession lasts until powerful magic is used to drive the demonic spirit out of its host."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Demon Lords",
								"entries": [
									"The chaotic power of the Abyss rewards demons of particular ruthlessness and ingenuity with a dark blessing, transforming them into unique fiends whose power can rival the gods. These demon lords rule through cunning or brute force, hoping to one day claim the prize of absolute control over all the Abyss.",
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Reward for Outsiders",
												"entries": [
													"Although most demon lords rise up from the vast and uncountable mobs of demons rampaging across the Abyss, the plane also rewards outsiders that conquer any of its infinite layers. The elven goddess Lolth became a demon lord after Corellon Larethian cast her into the Abyss for betraying elvenkind. Sages claim that the Dark Prince Graz'zt originated on some other plane before stealing his abyssal title from another long-forgotten demon lord."
												]
											}
										]
									},
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Power and Control",
												"entries": [
													"The greatest sign of a demon lord's power is its ability to reshape an abyssal realm. A layer of the Abyss controlled by a demon lord becomes a twisted reflection of that fiend's vile personality, and demon lords seldom leave their realms for fear of allowing another creature to reshape and seize it.",
													"As with other demons, a demon lord that dies on another plane has its essence return to the Abyss, where it reforms into a new body. Likewise, a demon lord that dies in the Abyss is permanently destroyed. Most demon lords keep a portion of their essence safely stored away to prevent such a fate."
												]
											}
										]
									},
									{
										"type": "entries",
										"name": "Baphomet",
										"entries": [
											"The demon lord Baphomet, also known as the Horned King and the Prince of Beasts, rules over minotaurs and other savage creatures. If he had his way, civilization would crumble and all races would embrace their base animal savagery.",
											"The Prince of Beasts appears as a huge, black-furred minotaur with iron horns, red eyes, and a blood-soaked mouth. His iron crown is topped with the rotting heads of his enemies, while his dark armor is set with spikes and skull-like serrations. He carries a huge glaive named Heartcleaver, but often hurls it into the fray so as to face his enemies with horns and hooves."
										]
									},
									{
										"type": "entries",
										"name": "Demogorgon",
										"entries": [
											"The Sibilant Beast and the self-styled Prince of Demons, Demogorgon yearns for nothing less than undoing the order of the multiverse. An insane assemblage of features and drives, the Prince of Demons inspires fear and hatred among other demons and demon lords.",
											"Demogorgon towers three times the height of a human, his body as sinuous as a snake's and as powerful as a great ape's. Suckered tentacles take the place of his arms. His saurian lower torso ends in webbed and clawed feet, and a forked tail whose whip-like tips are armed with cruel blades. The Prince of Demons has two baleful baboon heads, both of them mad. It is only the conflict between the two halves of his dual nature that keeps the demon lord's ambitions in check."
										]
									},
									{
										"type": "entries",
										"name": "Graz'zt",
										"entries": [
											"The demon lord Graz'zt appears as a darkly handsome figure nearly nine feet tall. Those who refer to the Dark Prince as the most humanoid of the demon lords vastly underestimate the capacity for evil in his scheming heart.",
											"Graz'zt is a striking physical specimen, whose demonic nature shows in his ebon skin, pointed ears, yellow fangs, crown of horns, and six-fingered hands. He delights in finery, pageantry, and sating his decadent desires with subjects and consorts alike, among whom incubi and succubi are often his favorites."
										]
									},
									{
										"type": "entries",
										"name": "Juiblex",
										"entries": [
											"The demon lord of slimes and oozes, Juiblex is a stew of noxious fluids that lurks in the abyssal depths. The wretched Faceless Lord cares nothing for cultists or mortal servants, and its sole desire is to turn all creatures into formless copies of its horrid self.",
											"In its resting state, Juiblex spreads out in a noxious mass, bubbling and filling the air with a profound stench. On the rare occasions when creatures confront the demon lord, Juiblex draws itself up into a shuddering cone of slime striated with veins of black and green. Baleful red eyes swim within its gelatinous body, while dripping pseudopods of ooze lash out hungrily at any creature they can reach."
										]
									},
									{
										"type": "entries",
										"name": "Lolth",
										"entries": [
											"The Demon Queen of Spiders is the evil matron of the drow. Her every thought is touched by malice, and the depth of her viciousness can surprise even her most faithful priestesses. She directs her faithful while she weaves plots across the worlds of the Material Plane, looking forward to the time when her drow followers bring those worlds under her control.",
											"Lolth appears as a lithe, imperious drow matriarch when she manifests to her followers in the mortal realm, which she does with unusual frequency. When battle breaks out-or if she has a reason to remind her followers to fear her—Lolth's lower body transforms into that of a huge demonic spider, whose spike—tipped legs and mandibles tear foes apart."
										]
									},
									{
										"type": "entries",
										"name": "Orcus",
										"entries": [
											"Known as the Demon Prince of Undeath and the Blood Lord, the demon lord Orcus is worshiped by the undead and by living creatures that channel the power of undeath. A brooding and nihilistic entity, Orcus yearns to make the multiverse a place of death and darkness, forever unchanging except by his will.",
											"The Demon Prince of Undeath is a foul and corpulent creature, with a humanoid torso, powerful goat legs, and the desiccated head of a ram. His sore-ridden body stinks of disease, but his decaying head and glowing red eyes are as a creature already dead. Great black bat wings sprout from his back, stirring reeking air as he moves.",
											"Orcus wields a malevolent artifact known as the Wand of Orcus, a mace-like rod of obsidian topped by a humanoid skull. He surrounds himself with undead, and living creatures not under his control are anathema to him."
										]
									},
									{
										"type": "entries",
										"name": "Yeenoghu",
										"entries": [
											"Known as the Gnoll Lord and the Beast of Butchery, the demon lord Yeenoghu hungers for slaughter and senseless destruction. Gnolls are his mortal instruments, and he drives them to ever-greater atrocities in his name. Delighting in sorrow and hopelessness, the Gnoll Lord yearns to turn the world into a wasteland in which the last surviving gnolls tear each other apart for the right to feast upon the dead.",
											"Yeenoghu appears as a huge, scarred gnoll with a spiky crest of black spines, and eyes that burn with emerald flame. His armor is a patchwork of shields and breastplates claimed from fallen foes, and decorated by those foes' flayed skins. Yeenoghu can summon a triple flail he calls the Butcher, which he wields to deadly effect or wills to fly independently into battle as he tears foes apart with teeth and claws."
										]
									},
									{
										"type": "entries",
										"name": "Other Demon Lords",
										"entries": [
											"No one knows the full number of demon lords that rage in the Abyss. Given the infinite depths of that plane, powerful demons constantly rise to become demon lords, then fall almost as quickly. Among the demon lords whose power has endured long enough for demonologists to name them are Fraz-Urb'luu, the Prince of Deception; Kostchtchie, the Prince of Wrath; Pazuzu, Prince of the Lower Aerial Kingdoms; and Zuggtmoy, Lady of Fungi."
										]
									},
									{
										"type": "entries",
										"name": "Demon Types",
										"entries": [
											"Demonologists organize the chaotic distribution of demons into broad categories of power known as types. Most demons fit into one of six major types, with the weakest categorized as Type 1 and the strongest as Type 6. Demons outside the six main types are categorized as minor demons and demon lords."
										]
									},
									{
										"type": "table",
										"caption": "Demons by Type",
										"colLabels": [
											"Type",
											"Examples"
										],
										"colStyles": [
											"col-2 text-center",
											"col-10"
										],
										"rows": [
											[
												"1",
												"barlgura, shadow demon, vrock"
											],
											[
												"2",
												"chasme, hezrou"
											],
											[
												"3",
												"glabrezu, yochlol"
											],
											[
												"4",
												"nalfeshnee"
											],
											[
												"5",
												"marilith"
											],
											[
												"6",
												"balor, goristro"
											]
										]
									},
									{
										"type": "inset",
										"name": "Demon True Names",
										"entries": [
											"Though demons all have common names, every demon lord and every demon of type 1 through 6 has a true name that it keeps secret. A demon can be forced to disclose its true name if {@condition charmed}, and ancient scrolls and tomes are said to exist that list the true names of the most powerful demons.",
											"A mortal who learns a demon's true name can use powerful summoning magic to call the demon from the Abyss and exercise some measure of control over it. However, most demons brought to the Material Plane in this manner do everything in their power to wreak havoc or sow discord and strife."
										]
									},
									{
										"type": "inset",
										"name": "Variant: Demon Summoning",
										"entries": [
											"Some demons can have an action option that allows them to summon other demons. Summon Demon (1/Day). The demon chooses what to summon and attempts a magical summoning.",
											{
												"type": "list",
												"items": [
													"A balor has a {@chance 50|50 percent} chance of summoning {@dice 1d8} vrocks, {@dice 1d6} hezrous, {@dice 1d4} glabrezus, {@dice 1d3} nalfeshnees, {@dice 1d2} mariliths, or one goristro.",
													"A barlgura has a {@chance 30|30 percent} chance of summoning one barlgura.",
													"A chasme has a {@chance 30|30 percent} chance of summoning one chasme.",
													"A glabrezu has a {@chance 30|30 percent} chance of summoning {@dice 1d3} vrocks, {@dice 1d2} hezrous, or one glabrezu.",
													"A hezrou has a {@chance 30|30 percent} chance of summoning {@dice 2d6} dretches or one hezrou.",
													"A marilith has a {@chance 50|50 percent} chance of summoning {@dice 1d6} vrocks, {@dice 1d4} hezrous, {@dice 1d3} glabrezus, {@dice 1d2} nalfeshnees, or one marilith.",
													"A nalfeshnee has a {@chance 50|50 percent} chance of summoning {@dice 1d4} vrocks, {@dice 1d3} hezrous, {@dice 1d2} glabrezus, or one nalfeshnee.",
													"A vrock has a {@chance 30|30 percent} chance of summoning {@dice 2d4} dretches or one vrock.",
													"A yochlol has a {@chance 50|50 percent} chance of summoning one yochlol."
												]
											},
											"A summoned demon appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 1 minute, until it or its summoner dies, or until its summoner dismisses it as an action."
										]
									}
								]
							},
							{
								"type": "insetReadaloud",
								"entries": [
									{
										"type": "quote",
										"entries": [
											"Demons are painfully difficult to summon and control. It is not a burden for the weak of heart or the weak of spirit."
										],
										"by": "From the {@style Demonomicon of Iggwilv|small-caps}"
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Balor.webp"
						}
					}
				]
			},
			"uniqueId": "1600725b-0d15-487b-a602-e98b77fe620d",
			"bonus": [
				{
					"name": "Teleport",
					"entries": [
						"The balor magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
					]
				}
			],
			"skill": {
				"perception": "+9",
				"intimidation": "+12"
			},
			"damageTags": [
				"B",
				"F",
				"L",
				"S"
			],
			"savingThrowForced": [
				"dexterity",
				"strength"
			]
		},
		{
			"name": "Flind (caster)",
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": {
				"type": "fiend",
				"tags": [
					"gnoll"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"alignmentPrefix": "Typically ",
			"ac": [
				{
					"ac": 15,
					"from": [
						"{@item studded leather armor|PHB}"
					]
				}
			],
			"hp": {
				"formula": "14d6 + 56",
				"average": 105
			},
			"speed": {
				"walk": 30
			},
			"str": 14,
			"dex": 16,
			"con": 18,
			"int": 14,
			"wis": 16,
			"cha": 18,
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 18,
			"languages": [
				"Gnoll",
				"Abyssal"
			],
			"cr": "9",
			"trait": [
				{
					"name": "Aura of Sleep",
					"entries": [
						"Any creature other than a flind that starts its turn within 15 feet of the flind must make a {@dc 15} Constitution saving throw. On a failed save, the creature is {@condition unconscious} for one minute. An {@condition unconscious} creature may repeat this saving throw at the end of each of its turns.",
						"If a creature succeeds on any of these saves or the effect ends on it, the creature is immune to Aura of Sleep for the next 24 hours."
					]
				}
			],
			"environment": [
				"coastal",
				"forest",
				"grassland",
				"hill"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/flind.mp3"
			},
			"attachedItems": [
				"longbow|phb"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"OTH",
				"AB"
			],
			"conditionInflict": [
				"unconscious"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/IDRotF/Gnoll%20Vampire.png",
			"fluff": {
				"name": "Flind",
				"source": "MPMM",
				"entries": [
					"When the demon lord Yeenoghu wants to create a particularly fearsome war band leader, he transforms an excep tionally strong and vicious gnoll into a demonic warrior known as a flind.",
					"A war band of demon-worshiping gnolls typically contains only one flind, and that creature sets the war band's path. Because of its special connection to Yeenoghu, a flind uses demonic insight to guide the gnolls toward weak prey ripe for slaughter.",
					"Unlike other leaders who might skulk behind their minions, a flind leads the charge in battle. Its flail causes wracking pain, paralysis, and disorientation in those it strikes."
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MPMM/Flind.webp"
						},
						"credit": "John Paul Balmet"
					}
				]
			},
			"save": {
				"con": "+9",
				"cha": "+9"
			},
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"The flind is a 14th-level spellcaster. Its spellcasting ability is Charisma (spell save {@dc 17}, +9 to hit with spell attacks). The flind has the following spells prepared:"
					],
					"will": [
						"{@spell fire bolt}"
					],
					"spells": {
						"1": {
							"spells": [
								"{@spell absorb elements|XGE}",
								"{@spell magic missile}",
								"{@spell shield}",
								"{@spell silvery barbs|SCC}"
							],
							"slots": 4
						},
						"2": {
							"spells": [
								"{@spell scorching ray}"
							],
							"slots": 3
						},
						"3": {
							"spells": [
								"{@spell counterspell}",
								"{@spell fireball}"
							],
							"slots": 3
						},
						"4": {
							"spells": [
								"{@spell banishment}",
								"{@spell sickening radiance|XGE}"
							],
							"slots": 3
						},
						"5": {
							"spells": [
								"{@spell Bigby's hand}",
								"{@spell insect plague}"
							],
							"slots": 2
						},
						"6": {
							"spells": [
								"{@spell disintegrate}"
							],
							"slots": 1
						},
						"7": {
							"spells": [
								"{@spell fire storm}"
							],
							"slots": 1
						}
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"spellcastingTags": [
				"O"
			],
			"skill": {
				"intimidation": "+9",
				"stealth": "+8",
				"survival": "+8",
				"perception": "+8"
			},
			"uniqueId": "0f2e0dfe-26ae-49d9-a100-3cc0cb2854d7",
			"damageTagsSpell": [
				"B",
				"F",
				"O",
				"P",
				"R"
			],
			"savingThrowForced": [
				"constitution"
			],
			"savingThrowForcedSpell": [
				"charisma",
				"constitution",
				"dexterity"
			]
		},
		{
			"name": "Flind (ranged)",
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": {
				"type": "fiend",
				"tags": [
					"gnoll"
				]
			},
			"alignment": [
				"C",
				"E"
			],
			"alignmentPrefix": "Typically ",
			"ac": [
				{
					"ac": 16,
					"from": [
						"{@item breastplate|PHB}"
					]
				}
			],
			"hp": {
				"formula": "12d8 + 60",
				"average": 114
			},
			"speed": {
				"walk": 30
			},
			"str": 18,
			"dex": 20,
			"con": 20,
			"int": 12,
			"wis": 14,
			"cha": 16,
			"skill": {
				"perception": "+6",
				"intimidation": "+7",
				"athletics": "+8",
				"acrobatics": "+9",
				"survival": "+6",
				"stealth": "+9"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 16,
			"languages": [
				"Gnoll",
				"Abyssal"
			],
			"cr": "9",
			"trait": [
				{
					"name": "Aura of Sleep",
					"entries": [
						"Any creature other than a flind that starts its turn within 15 feet of the flind must make a {@dc 15} Constitution saving throw. On a failed save, the creature is {@condition unconscious} for one minute. An {@condition unconscious} creature may repeat this saving throw at the end of each of its turns.",
						"If a creature succeeds on any of these saves or the effect ends on it, the creature is immune to Aura of Sleep for the next 24 hours."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The flind can make three longbow attacks."
					]
				},
				{
					"name": "Longbow",
					"entries": [
						"{@atk rw} {@hit 8} to hit, range 150/600 ft., one target. {@h}9 ({@damage 1d8 + 4}) piercing damage and 9 {{@damage 2d8}} necrotic damage."
					]
				}
			],
			"environment": [
				"coastal",
				"forest",
				"grassland",
				"hill"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/flind.mp3"
			},
			"attachedItems": [
				"longbow|phb"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"OTH",
				"AB"
			],
			"miscTags": [
				"RW"
			],
			"conditionInflict": [
				"unconscious"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MPMM/Gnoll%20Hunter.png",
			"fluff": {
				"name": "Flind",
				"source": "MPMM",
				"entries": [
					"When the demon lord Yeenoghu wants to create a particularly fearsome war band leader, he transforms an excep tionally strong and vicious gnoll into a demonic warrior known as a flind.",
					"A war band of demon-worshiping gnolls typically contains only one flind, and that creature sets the war band's path. Because of its special connection to Yeenoghu, a flind uses demonic insight to guide the gnolls toward weak prey ripe for slaughter.",
					"Unlike other leaders who might skulk behind their minions, a flind leads the charge in battle. Its flail causes wracking pain, paralysis, and disorientation in those it strikes."
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MPMM/Flind.webp"
						},
						"credit": "John Paul Balmet"
					}
				]
			},
			"save": {
				"con": "+9",
				"dex": "+9"
			},
			"damageTagsSpell": [
				"B",
				"F",
				"O",
				"P",
				"R"
			],
			"savingThrowForcedSpell": [
				"charisma",
				"constitution",
				"dexterity"
			],
			"uniqueId": "096091b2-c80d-43d0-bc8d-fdbe6243f746",
			"bonus": [
				{
					"name": "Mark",
					"entries": [
						"The flind marks a target to kill. All of the flind's attacks' against that target receive a {@hit 2} to hit."
					]
				}
			],
			"damageTags": [
				"P"
			],
			"savingThrowForced": [
				"constitution"
			]
		},
		{
			"name": "Gigant",
			"source": "CM-M",
			"page": 1,
			"size": [
				"G"
			],
			"type": "monstrosity",
			"alignment": [
				"U"
			],
			"ac": [
				{
					"ac": 17,
					"from": [
						"weapon attacks"
					]
				},
				{
					"ac": 19,
					"from": [
						"spell attacks"
					]
				}
			],
			"hp": {
				"formula": "20d20 + 120",
				"average": 330
			},
			"speed": {
				"walk": 50,
				"burrow": 50,
				"fly": 80
			},
			"str": 24,
			"dex": 14,
			"con": 22,
			"int": 4,
			"wis": 14,
			"cha": 12,
			"save": {
				"wis": "+8",
				"dex": "+8"
			},
			"skill": {
				"perception": "+8",
				"stealth": "+8"
			},
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 18,
			"cr": "20",
			"trait": [
				{
					"name": "Spell-Resistant Carapace",
					"entries": [
						"The gigant has advantage on saving throws against spells, and any creature that makes a spell attack against the gigant has disadvantage on the attack roll.",
						"The gigant also has +2 AC to spell attack rolls."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the gigant fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Bloodied",
					"entries": [
						"When the gigant becomes bloodied (165 HP), its Mandibles and Talons attacks deal and extra 6 ({@damage 1d6 + 2}) damage."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The gigant makes one Mandibles attack and two Talons attacks."
					]
				},
				{
					"name": "Mandibles",
					"entries": [
						"{@atk mw} {@hit 13} to hit, reach 10 ft., one creature. {@h}18 ({@damage 3d6 + 7}) slashing damage, and the target has the {@condition grappled} condition (escape {@dc 17}). Until the grapple ends, the target takes 18 ({@damage 3d6 + 7}) slashing damage at the start of each of the gigant's turns. While the gigant is grappling a target, it can't use Mandibles against other targets, and it gains +2 to its AC and all saving throws."
					]
				},
				{
					"name": "Talons",
					"entries": [
						"{@atk mw} {@hit 13} to hit, reach 20 ft., one target. {@h}14 ({@damage 2d6 + 7}) slashing damage, and the target is pulled 10 feet straight toward the gigant."
					]
				},
				{
					"name": "Scale Dust {@recharge 5}",
					"entries": [
						"The gigant releases magical dust from its wings in a 30-foot cube. Each creature in that area must make a {@dc 19} Constitution saving throw, taking 45 ({@damage 10d8}) poison damage on a failed save, or half as much damage on a successful one. On a success or failure, the creature has the {@condition poisoned} condition for 1 hour. While {@condition poisoned} this way, the creature can't regain hit points."
					]
				}
			],
			"bonus": [
				{
					"name": "Drone",
					"entries": [
						"The gigant produces a horrid droning sound by rapidly beating its wings. Each creature within 10 feet of the gigant must succeed on a {@dc 19} Constitution saving throw or take 10 ({@damage 3d6}) thunder damage and have the {@condition incapacitated} condition until the end of its next turn. The gigant can then fly up to half its flying speed."
					]
				}
			],
			"senseTags": [
				"SD"
			],
			"actionTags": [
				"Multiattack"
			],
			"miscTags": [
				"MW",
				"RCH",
				"AOE"
			],
			"conditionInflict": [
				"incapacitated"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/BGG/Gigant.png",
			"fluff": {
				"name": "Gigant",
				"source": "BGG",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"A gigant is a towering insectile creature variously regarded as a harbinger of doom, a defender of nature, and a divine messenger of mysterious purpose. Giants regard them as a plague, since gigants prefer giants over other food. Some giants claim gigants are created by the weird magical aura that surrounds a gargantua.",
							"A gigant resembles an enormous beetle with legs ending in sharp talons. It uses its talons to bring creatures to its enormous mandibles, which are strong enough to carry a giant to the gigant's nest to be devoured.",
							"A gigant's wings are usually folded under its carapace, but the speedy flier can also beat its wings to create a horrible sound or to spread a toxic dust."
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/BGG/Gigant.webp"
						}
					}
				]
			},
			"uniqueId": "08ea485c-7d75-46d8-950f-6c19b1c3f4e0",
			"traitTags": [
				"Legendary Resistances"
			],
			"legendaryActions": 3,
			"legendary": [
				{
					"name": "Talon Attack",
					"entries": [
						"The gigant makes a Talons attack."
					]
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"poisoned"
			],
			"damageTags": [
				"I",
				"S",
				"T"
			],
			"savingThrowForced": [
				"constitution"
			]
		},
		{
			"name": "Ankheg",
			"source": "CM-M",
			"page": 1,
			"size": [
				"L"
			],
			"type": "monstrosity",
			"alignment": [
				"U"
			],
			"ac": [
				{
					"ac": 14,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "12d10 + 48",
				"average": 114
			},
			"speed": {
				"walk": 40,
				"burrow": 20
			},
			"str": 18,
			"dex": 14,
			"con": 18,
			"int": 2,
			"wis": 14,
			"cha": 8,
			"senses": [
				"darkvision 60 ft.",
				"tremorsense 60 ft."
			],
			"passive": 12,
			"cr": "5",
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The ankheg makes two Bite attacks."
					]
				},
				{
					"name": "Bite",
					"entries": [
						"{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}11 ({@damage 2d6 + 4}) slashing damage plus 7 ({@damage 2d6}) acid damage. If the target is a Large or smaller creature, it is {@condition grappled} (escape {@dc 16}). Until this grapple ends, the ankheg can bite only the {@condition grappled} creature and has advantage on attack rolls to do so, and it gets +2 to its AC and all saving throws."
					]
				},
				{
					"name": "Acid Spray {@recharge}",
					"entries": [
						"The ankheg spits acid in a line that is 30 foot cone provided that it has no creature {@condition grappled}. Each creature in that line must make a {@dc 16} Dexterity saving throw, taking 21 ({@damage 6d6}) acid damage on a failed save, or half as much damage on a successful one."
					]
				}
			],
			"environment": [
				"forest",
				"grassland"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/ankeg.mp3"
			},
			"senseTags": [
				"D",
				"T"
			],
			"miscTags": [
				"MW"
			],
			"conditionInflict": [
				"grappled"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MM/Ankheg.png",
			"fluff": {
				"name": "Ankheg",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"An ankheg resembles an enormous many-legged insect, its long antennae twitching in response to any movement around it. Its legs end in sharp hooks adapted for burrowing and grasping its prey, and its powerful mandibles can snap a small tree in half.",
									{
										"type": "entries",
										"name": "Lurkers in the Earth",
										"entries": [
											"The ankheg uses its powerful mandibles to dig winding tunnels deep beneath the ground. When it hunts, an ankheg burrows upward, waiting below the surface until its antennae detect movement from above. Then it bursts from the earth and seizes prey in its mandibles, crushing and grinding while it secretes acidic digestive enzymes. These enzymes help dissolve a victim for easy swallowing, but the ankheg can also squirt acid to take down foes."
										]
									},
									{
										"name": "Bane of Field and Forest",
										"type": "entries",
										"entries": [
											"Although ankhegs receive a certain portion of their nutrients from the soil through which they burrow, they must supplement their diet with fresh meat. Pastures teeming with grazing livestock and forests rife with game are an ankheg's prime hunting grounds. Ankhegs are thus the bane of farmers and rangers everywhere."
										]
									},
									{
										"name": "Earthen Tunnels",
										"type": "entries",
										"entries": [
											"As it burrows through earth, the ankheg leaves a narrow, partially collapsed tunnel in its wake. In these tunnels, one might find the remnants of molted ankheg chitin, hatched ankheg eggs, or the grisly remains of ankheg victims, including coins or other treasures scattered during the creature's attack."
										]
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Ankheg.webp"
						},
						"credit": "Christopher Burdett"
					}
				]
			},
			"uniqueId": "691a9761-041d-488b-9679-fa4cc053addd",
			"skill": {
				"stealth": "+5"
			},
			"resist": [
				"acid"
			],
			"conditionImmune": [
				"poisoned"
			],
			"actionTags": [
				"Multiattack"
			],
			"immune": [
				"poison"
			],
			"save": {
				"con": "+7"
			},
			"trait": [
				{
					"name": "Blooded",
					"entries": [
						"When the ankheg becomes blooded (57 HP), it instantly recharges its Acid Spray and uses it at the creature that last damaged it."
					]
				}
			],
			"damageTags": [
				"A",
				"S"
			],
			"savingThrowForced": [
				"dexterity"
			]
		},
		{
			"name": "Chasme",
			"source": "CM-M",
			"page": 1,
			"size": [
				"H"
			],
			"type": "monstrosity",
			"alignment": [
				"C",
				"E"
			],
			"ac": [
				{
					"ac": 15,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "16d10 + 80",
				"average": 168
			},
			"speed": {
				"walk": 20,
				"fly": 60
			},
			"str": 14,
			"dex": 20,
			"con": 20,
			"int": 2,
			"wis": 14,
			"cha": 10,
			"save": {
				"dex": "+9",
				"wis": "+6"
			},
			"skill": {
				"perception": "+6",
				"stealth": "+9"
			},
			"senses": [
				"blindsight 10 ft.",
				"darkvision 120 ft."
			],
			"passive": 16,
			"resist": [
				"necrotic"
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"poisoned"
			],
			"cr": "9",
			"trait": [
				{
					"name": "Magic Resistance",
					"entries": [
						"The chasme has advantage on saving throws against spells and other magical effects."
					]
				},
				{
					"name": "Spider Climb",
					"entries": [
						"The chasme can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
					]
				}
			],
			"action": [
				{
					"name": "Proboscis",
					"entries": [
						"The chasme targets one creature it can see within 10 feet of it. The target must succeed on a {@dc 18} Constitution saving throw, taking 41 ({@damage 9d8}) necrotic damage on a failed save, or half as much damage on a successful one. The chasme regains a number of hit points equal to half the amount of damage dealt."
					]
				}
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/chasme.mp3"
			},
			"traitTags": [
				"Magic Resistance",
				"Spider Climb"
			],
			"senseTags": [
				"B",
				"SD"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MM/Chasme.png",
			"fluff": {
				"name": "Chasme",
				"source": "MM",
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"This loathsome demon resembles an unspeakable crossing of humanoid and fly. A chasme shuffles about on four spindly legs that can find purchase on walls and ceilings. A droning sound precedes the approach of a chasme, inflicting foes with a terrible lethargy that leaves them open to attack.",
									"The lowly chasmes serve more powerful masters as interrogators or taskmasters. A chasme lives to dole out torture as punishment, and has a knack for spotting demons that have deserted their lords. Capturing and returning such traitors allows a chasme to torment the victim without fear of reprisal."
								]
							}
						]
					},
					{
						"type": "section",
						"name": "Demons",
						"entries": [
							"Spawned in the Infinite Layers of the Abyss, demons are the embodiment of chaos and evil-engines of destruction barely contained in monstrous form. Possessing no compassion, empathy, or mercy, they exist only to destroy.",
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Spawn of Chaos",
												"entries": [
													"The Abyss creates demons as extensions of itself, spontaneously forming fiends out of filth and carnage. Some are unique monstrosities, while others represent uniform strains virtually identical to each other. Other demons (such as manes) are created from mortal souls shunned or cursed by the gods, or which are otherwise trapped in the Abyss."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Capricious Elevation",
												"entries": [
													"Demons respect power and power alone. A greater demon commands shrieking mobs of lesser demons because it can destroy any lesser demon that dares to refuse its commands. A demon's status grows with the blood it spills; the more enemies that fall before it, the greater it becomes.",
													"A demon might spawn as a manes, then become a dretch, and eventually transform to a vrock after untold time spent fighting and surviving in the Abyss. Such elevations are rare, however, for most demons are destroyed before they attain significant power. The greatest of those that do survive make up the ranks of the demon lords that threaten to tear the Abyss apart with their endless warring.",
													"By expending considerable magical power, demon lords can raise lesser demons into greater forms, though such promotions never stem from a demon's deeds or accomplishments. Rather, a demon lord might warp a manes into a quasit when it needs an invisible spy, or turn an army of dretches into hezrous when marching against a rival lord. Demon lords only rarely elevate demons to the highest ranks, fearful of inadvertently creating rivals to their own power."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Abyssal Invasions",
												"entries": [
													"Wherever they wander across the Abyss, demons search for portals to the other planes. They crave the chance to slip free of their native realm and spread their dark influence across the multiverse, undoing the works of the gods, tearing down civilizations, and reducing the cosmos to despair and ruin.",
													"Some of the darkest legends of the mortal realm are built around the destruction wrought by demons set loose in the world. As such, even nations embroiled in bitter conflict will set their differences aside to help contain an outbreak of demons, or to seal off abyssal breaches before these fiends can break free."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Signs of Corruption",
												"entries": [
													"Demons carry the stain of abyssal corruption with them, and their mere presence changes the world for the worse. Plants wither and die in areas where abyssal breaches and demons appear. Animals shun the sites where a demon has made a kill. The site of a demonic infestation might be fouled by a stench that never abates, by areas of bitter cold or burning heat, or by permanent shadows that mark the places where these fiends lingered."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Eternal Evil",
												"entries": [
													"Outside the Abyss, death is a minor nuisance that no demon fears. Mundane weapons can't stop these fiends, and many demons are resistant to the energy of the most potent spells. When a lucky hero manages to drop a demon in combat, the fiend dissolves into foul ichor. It then instantly reforms in the Abyss, its mind and essence intact even as its hatred is inflamed.",
													"The only way to truly destroy a demon is to seek it in the Abyss and kill it there."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Protected Essence",
												"entries": [
													"A powerful demon can take steps to safeguard its life essence, using secret methods and abyssal metals to create an amulet into which part of that essence is ceded. If the demon's abyssal form is ever destroyed, the amulet allows the fiend to reform at a time and place of its choosing.",
													"Obtaining a demonic amulet is a dangerous enterprise, and simply seeking such a device risks drawing the attention of the demon that created it. A creature possessing a demonic amulet can exact favors from the demon whose life essence the amulet holds—or inflict great pain if the fiend resists. If an amulet is destroyed, the demon that created it is trapped in the Abyss for a year and a day."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Demonic Cults",
												"entries": [
													"Despite the dark risks involved in dealing with fiends, the mortal realm is filled with creatures that covet demonic power. Demon lords manipulate these mortal servants into performing ever greater acts of depravity, furthering the demon lord's ambitions in exchange for magic and other boons. However, a demon regards any mortals in its service as tools to use and then discard at its whim, consigning their mortal souls to the Abyss."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Demon Summoning",
												"entries": [
													"Few acts are as dangerous as summoning a demon, and even mages who bargain freely with devils fear the fiends of the Abyss. Though demons yearn to sow chaos on the Material Plane, they show no gratitude when brought there, raging against their prisons and demanding release.",
													"Those who would risk summoning a demon might do so to wrest information from it, press it into service, or send it on a mission that only a creature of absolute evil can complete. Preparation is key, and experienced summoners know the specific spells and magic items that can force a demon to bend to another's will. If a single mistake is made, a demon that breaks free shows no mercy as it makes its summoner the first victim of its wrath."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Bound Demons",
												"entries": [
													"The Book of Vile Darkness, the Black Scrolls of Ahm, and the Demonomicon of Iggwilv are the foremost authorities on demonic matters. These ancient tomes describe techniques that can trap the essence of a demon on the Material Plane, placing it within a weapon, idol, or piece of jewelry and preventing the fiend's return to the Abyss.",
													"An object that binds a demon must be specially prepared with unholy incantations and innocent blood. It radiates a palpable evil, chilling and fouling the air around it. A creature that handles such an object experiences unsettling dreams and wicked impulses, but is able to control the demon whose essence is trapped within the object. Destroying the object frees the demon, which immediately seeks revenge against its binder."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Demonic Possession",
												"entries": [
													"No matter how secure its bindings, a powerful demon often finds a way to escape an object that holds it. When a demonic essence emerges from its container, it can possess a mortal host. Sometimes a fiend employs stealth to hide a successful possession. Other times, it unleashes the full brunt of its fiendish drives through its new form.",
													"As long as the demon remains in possession of its host, the soul of that host is in danger of being dragged to the Abyss with the demon if it is exorcised from the flesh, or if the host dies. If a demon possesses a creature and the object binding the demon is destroyed, the possession lasts until powerful magic is used to drive the demonic spirit out of its host."
												]
											}
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Demon Lords",
								"entries": [
									"The chaotic power of the Abyss rewards demons of particular ruthlessness and ingenuity with a dark blessing, transforming them into unique fiends whose power can rival the gods. These demon lords rule through cunning or brute force, hoping to one day claim the prize of absolute control over all the Abyss.",
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Reward for Outsiders",
												"entries": [
													"Although most demon lords rise up from the vast and uncountable mobs of demons rampaging across the Abyss, the plane also rewards outsiders that conquer any of its infinite layers. The elven goddess Lolth became a demon lord after Corellon Larethian cast her into the Abyss for betraying elvenkind. Sages claim that the Dark Prince Graz'zt originated on some other plane before stealing his abyssal title from another long-forgotten demon lord."
												]
											}
										]
									},
									{
										"type": "entries",
										"entries": [
											{
												"type": "entries",
												"name": "Power and Control",
												"entries": [
													"The greatest sign of a demon lord's power is its ability to reshape an abyssal realm. A layer of the Abyss controlled by a demon lord becomes a twisted reflection of that fiend's vile personality, and demon lords seldom leave their realms for fear of allowing another creature to reshape and seize it.",
													"As with other demons, a demon lord that dies on another plane has its essence return to the Abyss, where it reforms into a new body. Likewise, a demon lord that dies in the Abyss is permanently destroyed. Most demon lords keep a portion of their essence safely stored away to prevent such a fate."
												]
											}
										]
									},
									{
										"type": "entries",
										"name": "Baphomet",
										"entries": [
											"The demon lord Baphomet, also known as the Horned King and the Prince of Beasts, rules over minotaurs and other savage creatures. If he had his way, civilization would crumble and all races would embrace their base animal savagery.",
											"The Prince of Beasts appears as a huge, black-furred minotaur with iron horns, red eyes, and a blood-soaked mouth. His iron crown is topped with the rotting heads of his enemies, while his dark armor is set with spikes and skull-like serrations. He carries a huge glaive named Heartcleaver, but often hurls it into the fray so as to face his enemies with horns and hooves."
										]
									},
									{
										"type": "entries",
										"name": "Demogorgon",
										"entries": [
											"The Sibilant Beast and the self-styled Prince of Demons, Demogorgon yearns for nothing less than undoing the order of the multiverse. An insane assemblage of features and drives, the Prince of Demons inspires fear and hatred among other demons and demon lords.",
											"Demogorgon towers three times the height of a human, his body as sinuous as a snake's and as powerful as a great ape's. Suckered tentacles take the place of his arms. His saurian lower torso ends in webbed and clawed feet, and a forked tail whose whip-like tips are armed with cruel blades. The Prince of Demons has two baleful baboon heads, both of them mad. It is only the conflict between the two halves of his dual nature that keeps the demon lord's ambitions in check."
										]
									},
									{
										"type": "entries",
										"name": "Graz'zt",
										"entries": [
											"The demon lord Graz'zt appears as a darkly handsome figure nearly nine feet tall. Those who refer to the Dark Prince as the most humanoid of the demon lords vastly underestimate the capacity for evil in his scheming heart.",
											"Graz'zt is a striking physical specimen, whose demonic nature shows in his ebon skin, pointed ears, yellow fangs, crown of horns, and six-fingered hands. He delights in finery, pageantry, and sating his decadent desires with subjects and consorts alike, among whom incubi and succubi are often his favorites."
										]
									},
									{
										"type": "entries",
										"name": "Juiblex",
										"entries": [
											"The demon lord of slimes and oozes, Juiblex is a stew of noxious fluids that lurks in the abyssal depths. The wretched Faceless Lord cares nothing for cultists or mortal servants, and its sole desire is to turn all creatures into formless copies of its horrid self.",
											"In its resting state, Juiblex spreads out in a noxious mass, bubbling and filling the air with a profound stench. On the rare occasions when creatures confront the demon lord, Juiblex draws itself up into a shuddering cone of slime striated with veins of black and green. Baleful red eyes swim within its gelatinous body, while dripping pseudopods of ooze lash out hungrily at any creature they can reach."
										]
									},
									{
										"type": "entries",
										"name": "Lolth",
										"entries": [
											"The Demon Queen of Spiders is the evil matron of the drow. Her every thought is touched by malice, and the depth of her viciousness can surprise even her most faithful priestesses. She directs her faithful while she weaves plots across the worlds of the Material Plane, looking forward to the time when her drow followers bring those worlds under her control.",
											"Lolth appears as a lithe, imperious drow matriarch when she manifests to her followers in the mortal realm, which she does with unusual frequency. When battle breaks out-or if she has a reason to remind her followers to fear her—Lolth's lower body transforms into that of a huge demonic spider, whose spike—tipped legs and mandibles tear foes apart."
										]
									},
									{
										"type": "entries",
										"name": "Orcus",
										"entries": [
											"Known as the Demon Prince of Undeath and the Blood Lord, the demon lord Orcus is worshiped by the undead and by living creatures that channel the power of undeath. A brooding and nihilistic entity, Orcus yearns to make the multiverse a place of death and darkness, forever unchanging except by his will.",
											"The Demon Prince of Undeath is a foul and corpulent creature, with a humanoid torso, powerful goat legs, and the desiccated head of a ram. His sore-ridden body stinks of disease, but his decaying head and glowing red eyes are as a creature already dead. Great black bat wings sprout from his back, stirring reeking air as he moves.",
											"Orcus wields a malevolent artifact known as the Wand of Orcus, a mace-like rod of obsidian topped by a humanoid skull. He surrounds himself with undead, and living creatures not under his control are anathema to him."
										]
									},
									{
										"type": "entries",
										"name": "Yeenoghu",
										"entries": [
											"Known as the Gnoll Lord and the Beast of Butchery, the demon lord Yeenoghu hungers for slaughter and senseless destruction. Gnolls are his mortal instruments, and he drives them to ever-greater atrocities in his name. Delighting in sorrow and hopelessness, the Gnoll Lord yearns to turn the world into a wasteland in which the last surviving gnolls tear each other apart for the right to feast upon the dead.",
											"Yeenoghu appears as a huge, scarred gnoll with a spiky crest of black spines, and eyes that burn with emerald flame. His armor is a patchwork of shields and breastplates claimed from fallen foes, and decorated by those foes' flayed skins. Yeenoghu can summon a triple flail he calls the Butcher, which he wields to deadly effect or wills to fly independently into battle as he tears foes apart with teeth and claws."
										]
									},
									{
										"type": "entries",
										"name": "Other Demon Lords",
										"entries": [
											"No one knows the full number of demon lords that rage in the Abyss. Given the infinite depths of that plane, powerful demons constantly rise to become demon lords, then fall almost as quickly. Among the demon lords whose power has endured long enough for demonologists to name them are Fraz-Urb'luu, the Prince of Deception; Kostchtchie, the Prince of Wrath; Pazuzu, Prince of the Lower Aerial Kingdoms; and Zuggtmoy, Lady of Fungi."
										]
									},
									{
										"type": "entries",
										"name": "Demon Types",
										"entries": [
											"Demonologists organize the chaotic distribution of demons into broad categories of power known as types. Most demons fit into one of six major types, with the weakest categorized as Type 1 and the strongest as Type 6. Demons outside the six main types are categorized as minor demons and demon lords."
										]
									},
									{
										"type": "table",
										"caption": "Demons by Type",
										"colLabels": [
											"Type",
											"Examples"
										],
										"colStyles": [
											"col-2 text-center",
											"col-10"
										],
										"rows": [
											[
												"1",
												"barlgura, shadow demon, vrock"
											],
											[
												"2",
												"chasme, hezrou"
											],
											[
												"3",
												"glabrezu, yochlol"
											],
											[
												"4",
												"nalfeshnee"
											],
											[
												"5",
												"marilith"
											],
											[
												"6",
												"balor, goristro"
											]
										]
									},
									{
										"type": "inset",
										"name": "Demon True Names",
										"entries": [
											"Though demons all have common names, every demon lord and every demon of type 1 through 6 has a true name that it keeps secret. A demon can be forced to disclose its true name if {@condition charmed}, and ancient scrolls and tomes are said to exist that list the true names of the most powerful demons.",
											"A mortal who learns a demon's true name can use powerful summoning magic to call the demon from the Abyss and exercise some measure of control over it. However, most demons brought to the Material Plane in this manner do everything in their power to wreak havoc or sow discord and strife."
										]
									},
									{
										"type": "inset",
										"name": "Variant: Demon Summoning",
										"entries": [
											"Some demons can have an action option that allows them to summon other demons. Summon Demon (1/Day). The demon chooses what to summon and attempts a magical summoning.",
											{
												"type": "list",
												"items": [
													"A balor has a {@chance 50|50 percent} chance of summoning {@dice 1d8} vrocks, {@dice 1d6} hezrous, {@dice 1d4} glabrezus, {@dice 1d3} nalfeshnees, {@dice 1d2} mariliths, or one goristro.",
													"A barlgura has a {@chance 30|30 percent} chance of summoning one barlgura.",
													"A chasme has a {@chance 30|30 percent} chance of summoning one chasme.",
													"A glabrezu has a {@chance 30|30 percent} chance of summoning {@dice 1d3} vrocks, {@dice 1d2} hezrous, or one glabrezu.",
													"A hezrou has a {@chance 30|30 percent} chance of summoning {@dice 2d6} dretches or one hezrou.",
													"A marilith has a {@chance 50|50 percent} chance of summoning {@dice 1d6} vrocks, {@dice 1d4} hezrous, {@dice 1d3} glabrezus, {@dice 1d2} nalfeshnees, or one marilith.",
													"A nalfeshnee has a {@chance 50|50 percent} chance of summoning {@dice 1d4} vrocks, {@dice 1d3} hezrous, {@dice 1d2} glabrezus, or one nalfeshnee.",
													"A vrock has a {@chance 30|30 percent} chance of summoning {@dice 2d4} dretches or one vrock.",
													"A yochlol has a {@chance 50|50 percent} chance of summoning one yochlol."
												]
											},
											"A summoned demon appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 1 minute, until it or its summoner dies, or until its summoner dismisses it as an action."
										]
									}
								]
							},
							{
								"type": "insetReadaloud",
								"entries": [
									{
										"type": "quote",
										"entries": [
											"Demons are painfully difficult to summon and control. It is not a burden for the weak of heart or the weak of spirit."
										],
										"by": "From the {@style Demonomicon of Iggwilv|small-caps}"
									}
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MM/Chasme.webp"
						}
					}
				]
			},
			"uniqueId": "1b03be5a-6b10-4118-a4ac-0a3c45d4b5a6",
			"damageTags": [
				"N"
			],
			"savingThrowForced": [
				"constitution"
			]
		},
		{
			"name": "Revel's End Guard",
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": {
				"type": "humanoid",
				"tags": [
					"any race"
				]
			},
			"alignment": [
				"A"
			],
			"ac": [
				{
					"ac": 16,
					"from": [
						"{@item breastplate|phb}"
					]
				}
			],
			"hp": {
				"formula": "9d10 + 27",
				"average": 76
			},
			"speed": {
				"walk": 30
			},
			"str": 20,
			"dex": 16,
			"con": 16,
			"int": 10,
			"wis": 12,
			"cha": 10,
			"skill": {
				"athletics": "+8",
				"perception": "+4",
				"investigation": "+3"
			},
			"passive": 14,
			"languages": [
				"any one language (usually Common)"
			],
			"cr": "4",
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The guard makes two longsword attacks or two bow attacks."
					]
				},
				{
					"name": "Longsword",
					"entries": [
						"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}16 ({@damage 2d10 + 5}) slashing damage."
					]
				},
				{
					"name": "Longbow",
					"entries": [
						"{@atk rw} {@hit 6} to hit, range 150/600ft., one target. {@h}14 ({@damage 2d10 + 3}) piercing damage."
					]
				}
			],
			"environment": [
				"arctic",
				"coastal",
				"forest",
				"grassland",
				"hill",
				"mountain",
				"underdark",
				"urban"
			],
			"soundClip": {
				"type": "external",
				"url": "https://5e.tools/audio/bestiary/guard.mp3"
			},
			"attachedItems": [
				"longbow|phb",
				"longsword|phb"
			],
			"actionTags": [
				"Multiattack",
				"Parry"
			],
			"languageTags": [
				"C",
				"X"
			],
			"miscTags": [
				"MW",
				"MLW",
				"RW"
			],
			"hasFluff": true,
			"tokenUrl": "https://5e.tools/img/MM/guard.png",
			"fluff": {
				"entries": [
					{
						"type": "entries",
						"entries": [
							{
								"type": "entries",
								"entries": [
									"Guards include members of a city watch, sentries in a citadel or fortified town, and the bodyguards of merchants and nobles."
								]
							}
						]
					}
				]
			},
			"uniqueId": "e35538cf-27d5-4a64-b1bd-afe2c77572d8",
			"save": {
				"con": "+6",
				"str": "+8"
			},
			"trait": [
				{
					"name": "Aggressive",
					"entries": [
						"As a bonus action, the guard can move up to its speed toward a hostile creature that it can see."
					]
				}
			],
			"traitTags": [
				"Aggressive"
			],
			"reaction": [
				{
					"name": "Parry",
					"entries": [
						"The guard adds 2 to its AC against one melee attack that would hit it. To do so, the guard must see the attacker and be wielding a melee weapon."
					]
				}
			],
			"damageTags": [
				"P",
				"S"
			]
		},
		{
			"name": "Revel's End Warden",
			"source": "CM-M",
			"page": 1,
			"basicRules": true,
			"size": [
				"M"
			],
			"type": {
				"type": "humanoid",
				"tags": [
					"any race"
				]
			},
			"alignment": [
				"A"
			],
			"ac": [
				{
					"ac": 18,
					"from": [
						"{@item plate armor|phb}"
					]
				}
			],
			"hp": {
				"formula": "16d10 + 80",
				"average": 168
			},
			"speed": {
				"walk": 30
			},
			"str": 20,
			"dex": 10,
			"con": 20,
			"int": 12,
			"wis": 14,
			"cha": 20,
			"passive": 17,
			"languages": [
				"any four languages"
			],
			"cr": "11",
			"spellcasting": [
				{
					"name": "Spellcasting",
					"headerEntries": [
						"The warden is a 15th-level spellcaster. His spellcasting ability is Charisma (spell save {@dc 18}, {@hit 10} to hit with spell attacks). The warden has the following spells prepared:"
					],
					"spells": {
						"0": {
							"spells": [
								"{@spell fire bolt}",
								"{@spell mage hand}"
							]
						},
						"1": {
							"spells": [
								"{@spell detect magic}",
								"{@spell magic missile}",
								"{@spell shield}"
							],
							"slots": 4
						},
						"2": {
							"spells": [
								"{@spell misty step}",
								"{@spell suggestion}"
							],
							"slots": 3
						},
						"3": {
							"spells": [
								"{@spell counterspell}",
								"{@spell fireball}",
								"{@spell spirit shroud|TCE}"
							],
							"slots": 3
						},
						"4": {
							"spells": [
								"{@spell ice storm}"
							],
							"slots": 3
						},
						"5": {
							"spells": [
								"{@spell destructive wave}",
								"{@spell holy weapon|XGE}"
							],
							"slots": 2
						}
					},
					"ability": "cha",
					"type": "spellcasting"
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The warden makes three attacks, using Glaive, Shortbow, or both."
					]
				},
				{
					"name": "Glaive",
					"entries": [
						"{@atk mw} {@hit 10} to hit, reach 10 ft., one target. {@h}10 ({@damage 1d10 + 5}) slashing damage plus 9 ({@damage 2d8}) necrotic damage."
					]
				},
				{
					"name": "Shortbow",
					"entries": [
						"{@atk rw} {@hit 6} to hit, range 80/320 ft., one target. {@h}5 ({@damage 1d6 + 2}) piercing damage plus 9 ({@damage 2d8}) necrotic damage."
					]
				}
			],
			"variant": [
				{
					"type": "variant",
					"name": "Familiars",
					"entries": [
						"Any spellcaster that can cast the {@spell find familiar} spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a {@creature crawling claw}, {@creature imp}, {@creature pseudodragon}, or {@creature quasit}."
					]
				}
			],
			"environment": [
				"urban"
			],
			"languageTags": [
				"X"
			],
			"spellcastingTags": [
				"O"
			],
			"hasFluff": true,
			"tokenUrl": "https://5e.tools/img/MPMM/Blackguard.png",
			"uniqueId": "787dfef5-822f-49ca-b594-49049a88567e",
			"skill": {
				"arcana": "+11",
				"athletics": "+10",
				"intimidation": "+10",
				"investigation": "+6",
				"perception": "+7"
			},
			"save": {
				"con": "+10",
				"cha": "+10"
			},
			"actionTags": [
				"Multiattack"
			],
			"miscTags": [
				"MW",
				"RCH",
				"MLW",
				"RW"
			],
			"attachedItems": [
				"glaive|phb",
				"shortbow|phb"
			],
			"bonus": [
				{
					"name": "Divine Smite",
					"entries": [
						"Immediately after the warden hits a target with an attack roll, the blackguard can expend a 1st level spell slot (or higher) to deal an extra 9 ({@damage 2d8}) necrotic damage. This damage can be increased by {@damage 1d8} per spell level above 1st."
					]
				}
			],
			"damageTags": [
				"N",
				"P",
				"S"
			],
			"damageTagsSpell": [
				"B",
				"C",
				"F",
				"N",
				"O",
				"R",
				"T"
			],
			"savingThrowForcedSpell": [
				"constitution",
				"dexterity",
				"wisdom"
			]
		},
		{
			"name": "Nightmare Beast",
			"source": "CM-M",
			"page": 1,
			"size": [
				"L"
			],
			"type": "monstrosity",
			"alignment": [
				"C",
				"E"
			],
			"alignmentPrefix": "typically ",
			"ac": [
				{
					"ac": 17,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "16d20 + 96",
				"average": 264
			},
			"speed": {
				"walk": 30,
				"climb": 30
			},
			"str": 26,
			"dex": 16,
			"con": 22,
			"int": 6,
			"wis": 12,
			"cha": 10,
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 11,
			"languages": [
				"understands the languages of its creator but can't speak"
			],
			"cr": "16",
			"trait": [
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the beast fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Siege Monster",
					"entries": [
						"The beast deals double damage to objects and structures."
					]
				},
				{
					"name": "Frenzy",
					"entries": [
						"When the beast's hit points go below half, it can make a tusk attack as a bonus action."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The beast makes two Claw attacks and one Tusk attack."
					]
				},
				{
					"name": "Claw",
					"entries": [
						"{@atk mw} {@hit 12} to hit, reach 15 ft., one target. {@h}14 ({@damage 1d12 + 8}) slashing damage, and if the target is a creature, it must succeed on a {@dc 21} Strength saving throw or be knocked {@condition prone}."
					]
				},
				{
					"name": "Tusk",
					"entries": [
						"{@atk mw} {@hit 12} to hit, reach 15 ft., one target. {@h}17 ({@damage 2d8 + 8}) slashing damage."
					]
				},
				{
					"name": "Disintegration Gaze {@recharge 6}",
					"entries": [
						"The beast targets one creature it can see within 60 feet of itself. The target must make a {@dc 18} Constitution saving throw, taking 70 ({@damage 10d6 + 40}) force damage on a failed save, or half as much damage on a successful one. If this magical effect reduces the target to 0 hit points, the target is disintegrated and leaves nothing behind, except a pile of ashes plus whatever equipment it was wearing or carrying."
					]
				}
			],
			"bonus": [
				{
					"name": "Teleport (2/Day)",
					"entries": [
						"The beast magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."
					]
				}
			],
			"legendary": [
				{
					"name": "Tusk Attack",
					"entries": [
						"The beast makes one Tusk attack."
					]
				},
				{
					"name": "Charge (Costs 2 Actions)",
					"entries": [
						"The beast moves up to its speed without provoking opportunity attacks, then makes two Tusk attacks."
					]
				},
				{
					"name": "Frightful Howl (Costs 2 Actions)",
					"entries": [
						"The beast howls as it exhales a cloud of magical fear gas in a 120-foot cone. Any creature in that area must succeed on a {@dc 18} Wisdom saving throw or be {@condition frightened} of the beast for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
					]
				}
			],
			"traitTags": [
				"Legendary Resistances",
				"Siege Monster"
			],
			"senseTags": [
				"SD"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"CS"
			],
			"miscTags": [
				"MW",
				"RCH",
				"AOE"
			],
			"conditionInflict": [
				"frightened",
				"prone"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/MCV1SC/Nightmare Beast.png",
			"fluff": {
				"name": "Nightmare Beast",
				"source": "MCV1SC",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"Nightmare beasts are enormous quadrupeds that stand 20 feet tall, or 40 feet tall when rearing on their hind legs.",
							"A nightmare beast's legs end in claws, enabling it to climb well despite its size. Its skin is thick and tough, and its teeth are long and sharp. A pair of long, curved tusks jut from the sides of the beast's mouth, and its large red eyes glow in the dark. The creature smashes through structures and fortifications with ease, and it doesn't hesitate to rend foes with its claws and gore them with its tusks, but its most devastating attack is its magical ability to disintegrate foes with its terrible gaze.",
							"Powerful spellcasters create nightmare beasts to serve as living siege engines. A single beast can lay waste to entire cities and armies."
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/MCV1SC/Nightmare Beast.webp"
						}
					}
				]
			},
			"uniqueId": "78744e48-7831-48d5-bc8b-cb0d7e7fa5e8",
			"damageTags": [
				"O",
				"S"
			],
			"savingThrowForced": [
				"constitution",
				"strength",
				"wisdom"
			]
		},
		{
			"name": "Prisoner 13",
			"isNpc": true,
			"isNamedCreature": true,
			"source": "CM-M",
			"page": 1,
			"size": [
				"M"
			],
			"type": {
				"type": "humanoid",
				"tags": [
					"dwarf",
					"monk"
				]
			},
			"alignment": [
				"N",
				"E"
			],
			"ac": [
				{
					"ac": 20,
					"from": [
						"mountain tattoo"
					]
				}
			],
			"hp": {
				"formula": "16d10 + 80",
				"average": 168
			},
			"speed": {
				"walk": 30
			},
			"str": 12,
			"dex": 20,
			"con": 20,
			"int": 16,
			"wis": 18,
			"cha": 16,
			"save": {
				"con": "+10",
				"wis": "+9",
				"dex": "+10"
			},
			"senses": [
				"darkvision 60 ft."
			],
			"passive": 19,
			"immune": [
				"poison",
				"psychic"
			],
			"conditionImmune": [
				"charmed",
				"poisoned"
			],
			"languages": [
				"Common",
				"Dwarvish",
				"Elvish",
				"Thieves' cant",
				"Undercommon"
			],
			"cr": "5",
			"trait": [
				{
					"name": "Antimagic Susceptibility",
					"entries": [
						"In an area of antimagic, Prisoner 13's tattoos and reactions don't function, and she suffers the following modifications to her statistics: her AC becomes 15, she loses her immunity to psychic damage and the charmed condition, and her Tattooed Strike becomes a melee attack that deals 7 ({@damage 1d8 + 5}) bludgeoning damage on a hit."
					]
				},
				{
					"name": "Mindlink Tattoos",
					"entries": [
						"Prisoner 13 has telepathic links with dozens of agents operating throughout the land. The links allow Prisoner 13 to communicate telepathically with each of these agents while they are both on the same plane of existence."
					]
				},
				{
					"name": "Mountain Tattoo",
					"entries": [
						"Prisoner 13's AC includes her Constitution modifier."
					]
				},
				{
					"name": "Shroud Tattoo",
					"entries": [
						"Prisoner 13 can't be targeted by divination spells or any feature that would read her thoughts, and she can't be perceived through magical scrying sensors. She can't be contacted telepathically unless she allows such contact."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"Prisoner 13 makes three Tattooed Strike attacks."
					]
				},
				{
					"name": "Tattooed Strike",
					"entries": [
						"{@atk mw,rw} {@hit 10} to hit, reach 5 ft. or range 60 ft., one target. {@h}20 ({@damage 3d8 + 5}) force damage."
					]
				},
				{
					"name": "Firestorm Tattoo {@recharge 5}",
					"entries": [
						"Prisoner 13 magically unleashes flame from the tattoo across her back, filling a 20-foot-radius sphere centered on her. Each other creature in that area must make a {@dc 19} Dexterity saving throw. On a failed save, the creature takes 36 ({@damage 7d10}) fire damage and is knocked {@condition prone}. On a successful save, it takes half as much damage and isn't knocked {@condition prone}."
					]
				},
				{
					"name": "River Tattoo",
					"entries": [
						"Prisoner 13 magically ends any effects causing the {@condition grappled} or {@condition restrained} conditions on herself. If she is bound with nonmagical restraints, she slips out of them."
					]
				}
			],
			"reaction": [
				{
					"name": "Readiness",
					"entries": [
						"When a creature Prisoner 13 can see within 60 feet of herself ends its turn, Prisoner 13 makes one Tattooed Strike attack or uses River Tattoo. She can then move up to her speed without provoking opportunity attacks."
					]
				}
			],
			"traitTags": [
				"Antimagic Susceptibility"
			],
			"senseTags": [
				"D"
			],
			"actionTags": [
				"Multiattack"
			],
			"languageTags": [
				"C",
				"D",
				"E",
				"TC",
				"U"
			],
			"miscTags": [
				"RW",
				"MW",
				"AOE"
			],
			"conditionInflict": [
				"prone"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/KftGV/Prisoner 13.png",
			"fluff": {
				"name": "Prisoner 13",
				"source": "KftGV",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"Prisoner 13 is a dwarf named Korda Glintstone. Prior to her incarceration years ago, Korda was an ally and agent of Clan Axebreaker, a moderately influential dwarf clan in a stronghold called Gauntlgrym. Korda built a network of informants and agents, ostensibly all to the benefit of Clan Axebreaker. With each success, she paid tattooists to inscribe a memorial of her triumph onto her skin. Using ancient rituals, Korda infused many of these artful etchings with the magic of Gauntlgrym's forges, granting her wondrous gifts.",
							"Korda grew too ambitious for her role as an agent, so she devised a plan to take power for herself. Over five years she took careful stock of Clan Axebreaker's wealth and, in one fell swoop, used her network of lieutenants to steal away most of the clan's gold, leaving only a pittance.",
							"Prisoner 13 is a cunning schemer, ruthless and patient. She listens and watches, absorbing every detail she can, and shares as little as she can get away with."
						]
					},
					{
						"type": "section",
						"entries": [
							{
								"type": "entries",
								"name": "Prisoner 13's Tattoos",
								"entries": [
									"Most of Prisoner 13's inkwork is covered by her uniform. Her tattoos include the following:",
									{
										"type": "list",
										"style": "list-hang-notitle",
										"items": [
											{
												"type": "item",
												"name": "Dwarven Poetry.",
												"entry": "An excerpt from a poem in Dwarvish script on her neck and across her shoulder blades reads, \"Endless dreams entombed in stone.\""
											},
											{
												"type": "item",
												"name": "Flames.",
												"entry": "A roiling storm of brilliant flames covers her back and ribs."
											},
											{
												"type": "item",
												"name": "Shroud.",
												"entry": "Black and gray smoke and shadows coil down her left arm, ending in runes on the fingers of her left hand."
											},
											{
												"type": "item",
												"name": "Knotwork.",
												"entry": "Purple and blue knotwork and runes run down her right arm, across the back of her right hand, and down the length of each finger. The runes on her fingers, known as the keystone tattoo, form the key to the vault in Gauntlgrym."
											},
											{
												"type": "item",
												"name": "Mountain.",
												"entry": "Silver and brown mountain peaks cover her chest, the tips following the angles of her collarbones."
											},
											{
												"type": "item",
												"name": "River.",
												"entry": "Swirling green and blue waters form a cascading river across her stomach, with scaly creatures leering from the water."
											},
											{
												"type": "item",
												"name": "Power and Plunder.",
												"entry": "Dwarvish script on her hips reads \"Power\" and \"Plunder."
											}
										]
									},
									"Traced among Prisoner 13's tattoos are tiny magical sigils, each one matching a twin tattooed on one of her agents. A character who examines any visible tattoos and succeeds on a DC 15 Intelligence (Investigation) check notices some of the hidden marks.",
									"A character who succeeds on a DC 15 Intelligence (Arcana) check determines that the sigils have something to do with minds or telepathy."
								]
							}
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/KftGV/Prisoner 13.webp"
						},
						"credit": "Katerina Ladon"
					},
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/KftGV/035-p13-006.prisoner-13-closeup.webp"
						},
						"credit": "Katerina Ladon"
					}
				]
			},
			"uniqueId": "d0c8d65f-2595-40c5-8257-658ecd03ccd6",
			"skill": {
				"survival": "+9",
				"perception": "+9",
				"intimidation": "+8",
				"persuasion": "+8",
				"deception": "+8",
				"acrobatics": "+10",
				"athletics": "+6",
				"arcana": "+8",
				"insight": "+9",
				"stealth": "+10",
				"sleight of hand": "+10"
			},
			"damageTags": [
				"B",
				"F",
				"O"
			],
			"savingThrowForced": [
				"dexterity"
			]
		},
		{
			"name": "Gigant",
			"source": "CM-M",
			"page": 1,
			"size": [
				"G"
			],
			"type": "monstrosity",
			"alignment": [
				"U"
			],
			"ac": [
				{
					"ac": 17,
					"from": [
						"natural armor"
					]
				}
			],
			"hp": {
				"formula": "20d20 + 120",
				"average": 330
			},
			"speed": {
				"walk": 50,
				"burrow": 50,
				"fly": 80
			},
			"str": 24,
			"dex": 14,
			"con": 22,
			"int": 4,
			"wis": 14,
			"cha": 12,
			"save": {
				"wis": "+8",
				"dex": "+8"
			},
			"skill": {
				"perception": "+8",
				"stealth": "+8"
			},
			"senses": [
				"darkvision 120 ft."
			],
			"passive": 18,
			"cr": "20",
			"trait": [
				{
					"name": "Spell-Resistant Carapace",
					"entries": [
						"The gigant has advantage on saving throws against spells, and any creature that makes a spell attack against the gigant has disadvantage on the attack roll."
					]
				},
				{
					"name": "Legendary Resistance (3/Day)",
					"entries": [
						"If the gigant fails a saving throw, it can choose to succeed instead."
					]
				},
				{
					"name": "Bloodied",
					"entries": [
						"When the gigant becomes bloodied (165 HP), its Mandibles and Talons attacks deal and extra 6 ({@damage 1d6 + 2}) damage."
					]
				}
			],
			"action": [
				{
					"name": "Multiattack",
					"entries": [
						"The gigant makes one Mandibles attack and two Talons attacks."
					]
				},
				{
					"name": "Mandibles",
					"entries": [
						"{@atk mw} {@hit 13} to hit, reach 10 ft., one creature. {@h}18 ({@damage 3d6 + 7}) slashing damage, and the target has the {@condition grappled} condition (escape {@dc 17}). Until the grapple ends, the target takes 18 ({@damage 3d6 + 7}) slashing damage at the start of each of the gigant's turns. While the gigant is grappling a target, it can't use Mandibles against other targets, and it gains +2 to its AC and all saving throws."
					]
				},
				{
					"name": "Talons",
					"entries": [
						"{@atk mw} {@hit 13} to hit, reach 20 ft., one target. {@h}14 ({@damage 2d6 + 7}) slashing damage, and the target is pulled 10 feet straight toward the gigant."
					]
				},
				{
					"name": "Scale Dust {@recharge 5}",
					"entries": [
						"The gigant releases magical dust from its wings in a 30-foot cube. Each creature in that area must make a {@dc 19} Constitution saving throw, taking 45 ({@damage 10d8}) poison damage on a failed save, or half as much damage on a successful one. On a success or failure, the creature has the {@condition poisoned} condition for 1 hour. While {@condition poisoned} this way, the creature can't regain hit points."
					]
				}
			],
			"bonus": [
				{
					"name": "Drone",
					"entries": [
						"The gigant produces a horrid droning sound by rapidly beating its wings. Each creature within 10 feet of the gigant must succeed on a {@dc 19} Constitution saving throw or take 10 ({@damage 3d6}) thunder damage and have the {@condition incapacitated} condition until the end of its next turn. The gigant can then fly up to half its flying speed."
					]
				}
			],
			"senseTags": [
				"SD"
			],
			"actionTags": [
				"Multiattack"
			],
			"miscTags": [
				"MW",
				"RCH",
				"AOE"
			],
			"conditionInflict": [
				"incapacitated"
			],
			"hasFluff": true,
			"hasFluffImages": true,
			"tokenUrl": "https://5e.tools/img/BGG/Gigant.png",
			"fluff": {
				"name": "Gigant",
				"source": "BGG",
				"entries": [
					{
						"type": "entries",
						"entries": [
							"A gigant is a towering insectile creature variously regarded as a harbinger of doom, a defender of nature, and a divine messenger of mysterious purpose. Giants regard them as a plague, since gigants prefer giants over other food. Some giants claim gigants are created by the weird magical aura that surrounds a gargantua.",
							"A gigant resembles an enormous beetle with legs ending in sharp talons. It uses its talons to bring creatures to its enormous mandibles, which are strong enough to carry a giant to the gigant's nest to be devoured.",
							"A gigant's wings are usually folded under its carapace, but the speedy flier can also beat its wings to create a horrible sound or to spread a toxic dust."
						]
					}
				],
				"images": [
					{
						"type": "image",
						"href": {
							"type": "internal",
							"path": "bestiary/BGG/Gigant.webp"
						}
					}
				]
			},
			"traitTags": [
				"Legendary Resistances"
			],
			"legendaryActions": 3,
			"legendary": [
				{
					"name": "Talon Attack",
					"entries": [
						"The gigant makes a Talons attack."
					]
				}
			],
			"immune": [
				"poison"
			],
			"conditionImmune": [
				"poisoned"
			],
			"uniqueId": "34757f6d-9433-4cb3-a5ef-e48fc84ab959",
			"damageTags": [
				"I",
				"S",
				"T"
			],
			"savingThrowForced": [
				"constitution"
			]
		}
	],
	"item": [
		{
			"name": "Demonomicon",
			"source": "CM-M",
			"page": 1,
			"rarity": "artifact",
			"wondrous": true,
			"recharge": "midnight",
			"rechargeAmount": "{@dice 1d8}",
			"charges": 8,
			"entries": [
				"An expansive treatise documenting the Abyss's infinite layers and inhabitants, the Demonomicon of Iggwilv is the most thorough and blasphemous tome of demonology in the multiverse. The tome recounts both the oldest and most current profanities of the Abyss and demons. Demons have attempted to censor the text, and while sections have been ripped from the book's spine, the general chapters remain, ever revealing demonic secrets. And the book holds more than blasphemies. Caged behind lines of script roils a secret piece of the Abyss itself, which keeps the book up-to-date, no matter how many pages are removed, and it longs to be more than mere reference material.",
				{
					"type": "entries",
					"name": "Enhanced Properties",
					"entries": [
						"The artifact has the following enhanced properties:",
						{
							"type": "list",
							"items": [
								"Your Charisma increases by 2, to a maximum of 24.",
								"You gain a +1 bonus to Armor Class.",
								"You have resistance to necrotic damage.",
								"Undead are always hostile towards you."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Abyssal Reference",
					"entries": [
						"You can reference the {@i Demonomicon} whenever you make an Intelligence check to discern information about demons or a Wisdom ({@skill Survival}) check related to the Abyss. When you do so, you can add double your proficiency bonus to the check."
					]
				},
				{
					"type": "entries",
					"name": "Eldritch Incarnate",
					"entries": [
						"As a bonus action, you begin to channel additional power directly from your patron. For 1 minute, all attacks rolls you make can be done with advantage, and your spell save DC increases by 1. Once this property is used, it can't be used again until after a long rest."
					]
				},
				{
					"type": "entries",
					"name": "Fiendish Scourging",
					"entries": [
						"Your magic causes pain to fiends. While carrying the book, when you make a damage roll for a spell you cast against a fiend, you use the maximum possible result instead of rolling."
					]
				},
				{
					"type": "entries",
					"name": "Spells",
					"entries": [
						"The book has 8 charges and regains all expended charges daily at midnight. While holding it, you can use an action to cast {@spell Tasha's hideous laughter} from it or to expend 1 or more of its charges to cast one of the following spells (save DC 20) from it: {@spell magic circle} (1 charge), {@spell magic jar} (3 charges), {@spell planar ally} (3 charges), {@spell planar binding} (2 charges), {@spell plane shift} (to layers of the Abyss only; 3 charges), {@spell soul cage|XGE} (2 charges), {@spell summon fiend|TCE} (3 charges). You can increase the spell slot level by one for each additonal charge you spend."
					]
				}
			],
			"attachedSpells": [
				"magic circle",
				"magic jar",
				"planar ally",
				"planar binding",
				"plane shift",
				"summon fiend|tce",
				"soul cage|xge",
				"tasha's hideous laughter"
			],
			"hasFluffImages": true
		},
		{
			"name": "Amulet of the Warlock",
			"source": "CM-M",
			"page": 1,
			"rarity": "legendary",
			"wondrous": true,
			"recharge": "dawn",
			"entries": [
				{
					"type": "entries",
					"name": "Eldritch Drain",
					"entries": [
						"When you score a critical hit with your eldritch blast cantrip, pick a creature you can see within 30 feet of you. You and the chosen creature can immediately expend a Hit Die to regain hit points."
					]
				},
				{
					"type": "entries",
					"name": "Arcane Secrets",
					"entries": [
						"Once per day, whenever you cast a spell from one of your Mystic Arcanum, you can choose to not consume your arcanum spell slot. This feature recharges daily at dawn."
					]
				}
			],
			"hasFluffImages": true
		},
		{
			"name": "Orrery of the Wanderer",
			"source": "CM-M",
			"page": 1,
			"rarity": "artifact",
			"wondrous": true,
			"bonusAc": "+1",
			"recharge": "dawn",
			"rechargeAmount": "{@dice 1d4 + 6}",
			"charges": 7,
			"entries": [
				"This delicate and exquisitely crafted clockwork orrery features multiple geared components whose sweeping hands and dials represent the complex interplay of planar and magical realms. Standing two feet high, the orrery housing is a wondrous device imbued with magic of its own, but the power of its six clockwork components makes the artifact even more potent.",
				{
					"type": "entries",
					"name": "Enhanced Properties",
					"entries": [
						"The orrery has the following enhanced properties:",
						{
							"type": "list",
							"items": [
								"Your Intelligence increases by 2, to a maximum of 24.",
								"You have a +1 bonus to Armor Class.",
								"You can't be charmed or frightened.",
								"When you first receive this item, your Strength and Wisdom are reduced by 2."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "The Sum of Its Parts",
					"entries": [
						"Each of the six components that powers the Orrery of the Wanderer is a powerful magic relic in its own right:",
						{
							"type": "list",
							"style": "list",
							"items": [
								"The {@item chronolometer|AI}",
								"The {@item dimensional loop|AI}",
								"The {@item far gear|AI}",
								"The {@item rotor of return|AI}",
								"The {@item timepiece of travel|AI}",
								"The {@item wheel of stars|AI}"
							]
						},
						"Once all six components are installed, the orrery allows you to attune to one additional magical item."
					]
				},
				{
					"type": "entries",
					"name": "Future Echoes",
					"entries": [
						"With or without its components, the orrery lets you catch momentary glimpses of the future that warn you of danger. As long as the orrery is within 30 feet of you, you gain a +1 bonus to AC and all saving throws.",
						"Once all six components are installed, the echoes are empowered and you receive more clear premonitions of what's to come. These premonitions grant you one additional reaction. They also allow you to add your Intelligence modifier to your initiative rolls."
					]
				},
				{
					"type": "entries",
					"name": "Master of Time and Space",
					"entries": [
						"While all six components of the Orrery of the Wanderer are installed, the artifact has 9 charges. While touching the orrery, you can expend 1 or more charges to cast one of the following spells using your spell save DC: {@spell pulse wave|EGW} (1 charge), {@spell gravity sinkhole|EGW} (2 charge), {@spell temporal shunt|EGW} (3 charges), {@spell gravity fissure|EGW} (3 charges), {@spell dark star|EGW} (4 charges), {@spell reality break|EGW} (4 charges), {@spell time ravage|EGW} (5 charges), and {@spell ravenous void|EGW} (5 charges). You can increase the spell slot level by one for each additonal charge you spend. The orrery regains all expended charges daily at dawn."
					]
				}
			],
			"attachedSpells": [
				"pulse wave",
				"gravity sinkhole",
				"temporal shunt",
				"gravity fissure",
				"dark star",
				"reality break",
				"time ravage",
				"ravenous void"
			],
			"hasFluffImages": true
		},
		{
			"name": "Amulet of the Artificer",
			"source": "CM-M",
			"page": 1,
			"rarity": "legendary",
			"wondrous": true,
			"recharge": "dawn",
			"entries": [
				{
					"type": "entries",
					"name": "Sized Spells",
					"entries": [
						"You can change the size of the effects from your spells and cannons, increasing or decreasing the overall dimensions by up to 10 feet."
					]
				},
				{
					"type": "entries",
					"name": "Precision Fire",
					"entries": [
						"Your cannons gain a +2 bonus to spell attack rolls and to saving throw DCs."
					]
				}
			],
			"hasFluffImages": true
		},
		{
			"name": "Bigby's Beneficent Bracelet",
			"source": "CM-M",
			"page": 1,
			"rarity": "artifact",
			"wondrous": true,
			"entries": [
				"This gorgeous jewelry piece, crafted by the wizard Bigby himself, consists of four gold rings attached via delicate chains to a wrist cuff studded with sapphires and diamonds.",
				{
					"type": "entries",
					"name": "Enhanced Properties",
					"entries": [
						"The bracelet has the following properties:",
						{
							"type": "list",
							"items": [
								"Your Charisma increases by 2, to a maximum of 24.",
								"You have a +1 bonus to Armor Class.",
								"You have resistance to force damage.",
								"This bracelet is constantly emitting a bright light. You have disadvantage on {@skill Stealth} checks."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Unlocked Polymorph",
					"entries": [
						"Whenever you cast Polymorph on yourself, you are no longer restricted to just creatures from the Beast category. You may now also select creatures from the Celestial, Elemental, and Fiend categories.",
						"Also, if you cast Polymorph on yourself, you may still benefit from and use class features and magical items."
					]
				},
				{
					"type": "entries",
					"name": "Unfailing Inspiration",
					"entries": [
						"When you or any creature rolls one of your Bardic Inspiration dice, if the outcome of the roll is not changed by the Bardic Inspiration die, you or the creature may keep the Bardic Inspiration die."
					]
				},
				{
					"type": "entries",
					"name": "Helpful Hand",
					"entries": [
						"As an action, you can use the bracelet to cast {@spell Bigby's hand} as a 9th-level spell with your spell attack bonus. When you cast the spell this way, the spell doesn't require {@status concentration}. Once this property is used, it can't be used again until the next dawn."
					]
				}
			],
			"attachedSpells": [
				"Bigby's hand"
			],
			"hasFluffImages": true
		},
		{
			"name": "Amulet of the Bard",
			"source": "CM-M",
			"page": 1,
			"rarity": "legendary",
			"wondrous": true,
			"entries": [
				{
					"type": "entries",
					"name": "Powerful Inspiration",
					"entries": [
						"If you or another creature rolls a 1 on your Bardic Inspiration dice, that die may be rerolled."
					]
				},
				{
					"type": "entries",
					"name": "Supreme Mockery",
					"entries": [
						"As an action, you can hurl a string of insults laced with enchantments at a creature you can see within 60 feet. If the creature can hear you (though it need not understand you), it must succeed on a Wisdom saving throw against your spell save DC or take a number of d12 equal to your level psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn. Once this property is used, it can't be used again until after a short rest."
					]
				}
			],
			"hasFluffImages": true
		},
		{
			"name": "Helm of Perfect Potential",
			"source": "CM-M",
			"page": 1,
			"rarity": "artifact",
			"wondrous": true,
			"entries": [
				"This copper-hued helm contains a shard of the Elemental Chaos embedded in its forehead, surrounded by a motif of a rising sun.",
				{
					"type": "entries",
					"name": "Enhanced Properties",
					"entries": [
						"The helm has the following enhanced properties:",
						{
							"type": "list",
							"items": [
								"Your Dexterity increases by 2, to a maximum of 24.",
								"You have a +1 bonus to attack and damage rolls, and your weapon attacks are considered magical for the purpose of overcoming immunity and resistance to nonmagical attacks.",
								"You gain a +1 bonus to Armor Class.",
								"Your main flaw is amplified."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Weapon Perfection",
					"entries": [
						"With the helm, you're able to envision new ways to perfectly use your weapons. When you roll to hit, choose from one of the following properties. If you make a successful weapon attack, you may apply your chosen effect.",
						{
							"type": "list",
							"items": [
								"{@b Slow} - The target creature's speed is reduced by 10 feet until the start of your next turn. A creature's speed can only be reduced with this only once per turn.",
								"{@b Push} - Push the target creature up to 10 feet away from you if it is of size Large or smaller.",
								"{@b Vex} - You have advantage on your next attack roll against that creature before the end of your turn.",
								"{@b Sap} - The target creature has disadvantage on its next attack roll before the start of your next turn.",
								"{@b Gash} - The target must make a Dexterity saving throw equal to 8 + your proficiency bonus + your Dexterity modifer. If the fail, they will take {@dice 1d6} damage if they choose to move on their turn. This effect can stack."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Weak Spot",
					"entries": [
						"Whenever you roll damage for Sneak Attack, you may roll it a second time and take whichever total."
					]
				},
				{
					"type": "entries",
					"name": "Altered Appearance",
					"entries": [
						"While wearing the helm, you can tap it twice to gain the effects of the {@spell disguise self} spell on it to make it take the form of any hat or helm you can envision."
					]
				},
				{
					"type": "entries",
					"name": "Spellcasting",
					"entries": [
						"The helm has 7 charges and regains all charges each dawn. As an action while wearing the helm, you can expend 1 or more of its charges to cast one of the following spells (save DC 20): {@spell elemental weapon} (1 charge), {@spell call lightning} (2 charges), {@spell wall of fire} (3 charges), {@spell conjure elemental} (4 charges), {@spell wall of ice} (4 charges), {@spell tsunami} (5 charges), or {@spell sunburst} (5 charges). You can increase the spell slot level by one for each additonal charge you spend."
					]
				}
			],
			"attachedSpells": [
				"elemental weapon",
				"call lightning",
				"wall of fire",
				"conjure elemental",
				"wall of ice",
				"tsunami",
				"sunburst"
			],
			"hasFluffImages": true
		},
		{
			"name": "Amulet of the Bargue",
			"source": "CM-M",
			"page": 1,
			"rarity": "legendary",
			"wondrous": true,
			"entries": [
				{
					"type": "entries",
					"name": "Eye of Onos",
					"entries": [
						"As a bonus action, you can launch a bolt of searing elemental energy toward a creature you can see within 90 feet of yourself. The target must make a DC 20 Dexterity saving throw. On a failed save, the creature takes {@damage 5d6} acid, cold, fire, lightning, or thunder damage (your choice). On a successful save, the creature takes half as much damage."
					]
				},
				{
					"type": "entries",
					"name": "War Magic",
					"entries": [
						"Whenever you take the attack action, you can replace one of your two multiattacks with casting a spell that has the casting time of an action."
					]
				}
			],
			"hasFluffImages": true
		},
		{
			"name": "Staff of the Elements",
			"source": "CM-M",
			"page": 1,
			"srd": true,
			"tier": "major",
			"rarity": "legendary",
			"weight": 4,
			"weaponCategory": "simple",
			"property": [
				"V"
			],
			"dmg1": "1d6",
			"dmgType": "B",
			"dmg2": "1d8",
			"bonusSpellAttack": "+1",
			"recharge": "dawn",
			"rechargeAmount": "{@dice 2d8 + 4}",
			"charges": 20,
			"staff": true,
			"entries": [
				"You gain a +1 bonus to spell attack rolls and to the saving throw DCs of your spells.",
				"The staff has 20 charges for the following properties. The staff regains {@dice 2d8 + 4} expended charges daily at dawn.",
				{
					"type": "entries",
					"name": "Elemental Resistance",
					"entries": [
						"You have advantage on saving throws against spell and other magical effects."
					]
				},
				{
					"type": "entries",
					"name": "Elemental Affinity",
					"entries": [
						"You can choose one damage type when you finish a short or long rest. Spells you cast ignore resistance to damage of the chosen type."
					]
				},
				{
					"type": "entries",
					"name": "Spells",
					"entries": [
						"While holding this staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spell attack bonus: {@spell magic missile} (1 charge), {@spell moonbeam} (2 charges), {@spell rime's binding ice|FTD} (2 charges), {@spell tasha's mind whip|TCE} (2 charges), {@spell fireball} (3 charges), {@spell thunder step|XGE} (3 charges) {@spell raulothim's psychic lance|FTD} (4 charges), {@spell cone of cold} (5 charges), {@spell dawn|XGE} (5 charges), {@spell steel wind strike|XGE} (5 charges), {@spell chain lightning} (6 charges), {@spell disintegrate} (6 charges), {@spell harm} (6 charges), or {@spell crown of stars|XGE} (7 charges). You can increase the spell slot level by one for each additional charge you expend."
					]
				}
			],
			"attachedSpells": [
				"magic missile",
				"moonbeam",
				"rime's binding ice|FTD",
				"tasha's mind whip|TCE",
				"fireball",
				"thunder step|XGE",
				"raulothim's psychic lance|FTD",
				"cone of cold",
				"dawn|XGE",
				"steel wind strike|xge",
				"chain lightning",
				"disintegrate",
				"harm",
				"crown of stars|XGE"
			],
			"hasFluffImages": true
		}
	]
}